{
    "en": {
        "spanish": "Spanish",
        "english": "English",
        "japanese": "Japanese",

        "home": "Home",
        "projects": "Projects",
        "contacts":"Contacts",

        "greetings": "Greetings!",
        "intro": "My name is <fn> <ln1> <ln2> \n I also go by the pen name <pn>",
        
        "aboutHeader": "About Me",
        "about": "Dedicated Computer Science student at the University of Puerto Rico Bayamon, with approximately <years> years of experience. \n My journey began in high school, and I have actively participated in a video game research team, where we developed various games using different engines, which challenged us to learn new tools and adapt to diverse environments. \n Additionally, I have engaged in several passion projects that have provided me with invaluable insights and hands-on experience in the software development process. I am committed to continuous learning and skill enhancement in my spare time, striving to maximize every opportunity for growth.",
        
        "skills": "Technical Skills",
        "skillsLang": "Languages",
        "skillsTools": "Tools",
        "skillsGame": "Game",
        "skillsWeb": "Web",
        
        "projectList": "Projects",

        "viewPage": "View Page",

        "demoHeader": "Demo",
        "videoHeader": "Preview",
        "linksHeader": "Links",
        
        "resume": "Resume",
        "email": "Email",
        "sourceCode": "Source Code",

        "titleBGMAPP": "Background Music Application",
        "miniSummaryBGMAPP": "Track Player",
        "summaryBGMAPP": "Electron Track Player",
        "detailsBGMAPP": "Track player made using Electron and Vite, offers the functionality to play music tracks sourced from either a local directory or directly from online sources. \n The track player is thoughtfully crafted with an intuitive user interface that has been strategically placed to effectively control and manage the player's state. While also containing various optimizations tricks thanks to virtualization and lazy loading. \n These design were thoroughly crafted especially to contribute to a seamless user experience, allowing for effortless control and smooth navigation throughout the application.",

        "titleViewBGMAPP": "Listen to music without distractions",
        "descViewBGMAPP": "Comes equipped with tools to integrate local music tracks and online tracks by allowing the user to insert their own music.",
        "titleShuffleBGMAPP": "Preserving essential features",
        "descShuffleBGMAPP": "Basic functionality of any typical track player, so that there is no need to reinvent the wheel, and unnecessarily force change.",
        "titleInputSearchBGMAPP": "Big library? No problem",
        "descInputSearchBGMAPP": "Fundamentally set in consideration the large quantities of tracks, it is optimized for extensive libraries thanks to its lazy loading and virtualization.",
        "titleContextMenuBGMAPP": "UI that you won’t remember",
        "descContextMenuBGMAPP": "Various UI techniques integrated to minimize user interference and simplify interaction.",

        "titleL2DWP": "Live 2D Wallpaper",
        "miniSummaryL2DWP": "Live Wallpaper",
        "summaryL2DWP": "Interactive Live 2D Wallpaper",
        "detailsL2DWP": "Interactable Live2D wallpaper made in Unity & Android Studio, which can contain various Live2D characters to interact with. \n The game functions as a live wallpaper that allows users to interact with these characters by clicking on them, triggering various emotions and voice lines. While primarily designed to be used as an Android wallpaper, it is also compatible with PC and WebGL platforms. \n Additionally, the Android version supports plugins that enable the utilization of native Android functions.",

        "titleCharacterIdleL2DWP": "Stay connected",
        "descCharacterIdleL2DWP": "Enables integration as an Android wallpaper, providing the opportunity to enjoy a fully customized live wallpaper.",
        "titleCharacterTalkL2DWP": "Engagement enhances experience",
        "descCharacterTalkL2DWP": "Interacting with the Live2D character can activate a range of delightful interactions, including emotions and voice lines.",
        "titleCharacterUIL2DWP": "Integrated UI for functionality",
        "descCharacterUIL2DWP": "Comes equipped with UI to configurate settings of the Android thanks to its Android Studio plugins.",
        "titleNextCharacterTalkL2DWP": "Personalized experience",
        "descNextCharacterTalkL2DWP": "Effortlessly integrate any character that supports Live2D Cubism to the wallpaper, creating a truly personal experience",

        "titleSYMBIOMATA": "Project Coop Virtual Reality (PCVR)",
        "miniSummarySYMBIOMATA": "VR Coop Game",
        "summarySYMBIOMATA": "Asymmetrical VR Coop Game",
        "detailsSYMBIOMATA": "Asymmetrical VR coop platformer made in Unity, where the VR player is in charge of hand actions and the PC player is in charge of platforming. \n The game features both local and online game modes. The latter of which is designed with a server-authoritative architecture using standard industry practices and features, such as client-side prediction for VR hand movement and projectile lag compensation, along with relay and lobbies for easy matchmaking. \n Footage included was taken from real online gameplay.",

        "titleSlashSYMBIOMATA": "Transcend realities, no matter the distance",
        "descSlashSYMBIOMATA": "Experience the thrill locally or online. Choose to team up on the same machine or connect with someone across the globe over the internet.",
        "title2DSYMBIOMATA": "Teamwork is the key to victory",
        "desc2DSYMBIOMATA": "Success hinges on collaboration. The VR player relies on the PC player for guidance to navigate dangers, while the PC player depends on the VR player for ascension and protection against threats.",
        "titleZiplineSYMBIOMATA": "Navigate unique stages together",
        "descZiplineSYMBIOMATA": "Embark on an adventure through a variety of stages filled with obstacles specifically designed for seamless PC and VR cooperation.",
        "titleVRPovSYMBIOMATA": "Different perspectives, one shared journey",
        "descVRPovSYMBIOMATA": "Unique gameplay experience by allowing the PC player to control the character's movement while the VR player enjoys precise control over the immersive 3D environment using the XR controllers.",

        "titleONIGIRI": "Demon Slayer",
        "miniSummaryONIGIRI": "Souls-like Game",
        "summaryONIGIRI": "Unity 3D Souls-like Game",
        "detailsONIGIRI": "Souls-like singleplayer game made in Unity, where the player must defeat formidable bosses by parrying while also simultaneously evading their attacks. \n The core mechanic revolves around precise timing, players must parry in sync with the rhythm of the enemy’s attacks. By correctly anticipating the attack, the player can successfully counter and retaliate against the enemy.",

        "titleBossONIGIRI": "Retaliate against formidable adversaries",
        "descBossONIGIRI": "Enemy AI designed to enhance the overall challenge and engagement of the game, to incentivize decision making based on the situation.",
        "titleBossEntranceONIGIRI": "Embark on an adventure",
        "descBossEntranceONIGIRI": "World crafted with rich details of a fantasy feudal Japan where demons roam the land.",
        "titleBossParryONIGIRI": "Overcome fearsome obstacles",
        "descBossParryONIGIRI": "Core mechanic emphasizing the execution of precise parries against enemy attacks within a defined timing window, enabling effective counterattacks and retaliation against the opponents.",
        "titleMageONIGIRI": "Dodge your way to victory",
        "descMageONIGIRI": "Success also hinges on smart use of the dodging mechanic, where precise use is crucial for achieving victory.",
        "titleUnblockableONIGIRI": "Ride the rhythm of battle",
        "descUnblockableONIGIRI": "Enemies exhibit unique attack patterns, necessitating an adaptive, thoughtful, and strategic approach to effectively overcome.",

        "titleBURROUGHS": "BURROUGHS",
        "miniSummaryBURROUGHS": "WebRTC Player",
        "SummaryBURROUGHS": "WebRTC Player",
        "detailsBURROUGHS": "b1lah blah blah",

        "titleNEKOMATA": "P.U.R.R (Programmable Unit for Rewinding Reality)",
        "miniSummaryNEKOMATA": "BulletHell Game",
        "summaryNEKOMATA": "Bullet Hell Game",
        "detailsNEKOMATA": "Boss rush bullet hell game made in Unreal Engine 5, taking inspiration from the iconic top-down bullet hell Touhou series. \n The core mechanic of the game is the rewind ability, which gives the player an ability to dodge enemies’ incoming projectiles, consequently returning the player to a previous probable vulnerable position. \n The game features bosses with unavoidable projectiles to incentive constant use, while also maintaining an aspect of high risk/high reward. \n The game is also built with an advanced audio system to sync various scenarios based on the actions of both the enemies and the player.",

        "titleTutorialNEKOMATA": "Protocol Rewind",
        "descTutorialNEKOMATA": "Core mechanic of the game, where rewinding can be used to become invulnerable at the cost of going to a previous location, encouraging strategic use to maximize its benefits.",
        "titleBossFightNEKOMATA": "Challenging adversaries",
        "descBossFightNEKOMATA": "Every boss contains a unique bullet pattern, with multiple phases that as the stage progresses becomes more challenging and engaging.",
        "titleMinionFightNEKOMATA": "Immersive synchronized music",
        "descMinionFightNEKOMATA": "Extensive audio system built around synchronizing various scenarios with the music, providing a fully immersive gameplay experience. ",
        "titlePlagueRatBossNEKOMATA": "Unforgiving gameplay",
        "descPlagueRatBossNEKOMATA": "Challenging gameplay where the player must engage in a battle of wits, where knowledge and skill become the key to overcome formidable adversaries.",
        
        "titlePORTFOLIO": "Portfolio",
        "miniSummaryPORTFOLIO": "React Website",
        "summaryPORTFOLIO": "React Website",
        "detailsPORTFOLIO": "Portfolio website created entirely using React, Typescript, and Tailwind CSS, which serves as a showcase for a selection of projects that I have passionately created and worked on, marking a significant milestone in my development journey. \n Each project presented reflects my skills and creativity, demonstrating a commitment to quality and usability. \n Thank you for taking the time to explore my portfolio. Interest in my work is greatly appreciated, as I am eager to share my skills and projects. \n THANK YOU VERY MUCH!",

        "demo": "Try Demo",
        "demoError": "No Demo Available",

        "error": "The page you are looking for does not seem to exist. Please check the URL or navigate to the homepage."
    },

    "es": {
        "spanish": "Español",
        "english": "Inglés",
        "japanese": "Japonés",

        "home": "Hogar",
        "projects": "Proyectos",
        "contacts":"Contactos",

        "greetings": "¡Bienvenidos!",
        "intro": "Me llamo <fn> <ln1> <ln2> \n También uso el pen name <pn>",

        "aboutHeader": "Sobre mí",
        "about": "Estudiante apasionado a las Ciencias de Computadoras en la Universidad de Puerto Rico Bayamón, con aproximadamente 7 años de experiencia. \n Mi viaje a esta ciencia empezó en escuela superior, y activamente he estado participando en un equipo de investigación de video juegos, en donde desarrollamos varios juegos con distintos engines de video juegos. \n Adicionalmente, he hecho varios proyectos que me han apasionado y que me han aportado valiosa perspectiva y experiencia práctica en el proceso de desarrollo de software. Estoy comprometido con el aprendizaje continuo y la mejora de habilidades en mi tiempo libre, esforzándome por maximizar cada oportunidad de crecimiento.",

        "skills": "Destrezas",
        "skillsLang": "Lenguajes",
        "skillsTools": "Tools",
        "skillsGame": "Juego",
        "skillsWeb": "Web",

        "projectList": "Proyectos",

        "viewPage": "Ver Pagina",

        "demoHeader": "Demo",
        "videoHeader": "Video",
        "linksHeader": "Enlaces",

        "resume": "Resume",
        "email": "Email",
        "sourceCode": "Source Code",

        "titleBGMAPP": "Aplicación de música ambiental",
        "miniSummaryBGMAPP": "Jugador Musico",
        "summaryBGMAPP": "Jugador Musico Electron",
        "detailsBGMAPP": "Jugador musico hecho usando Electron y Vite, ofrece la posibilidad de escuchar música de un directorio local o directamente de una fuente en línea. \n El jugador musico está diseñado con una interfaz de usuario intuitiva que se colocó estratégicamente para controlar el estado del jugador musico. Además, contiene varios trucos de optimización gracias a la virtualización y a lazy loading. \n Estos diseños se han elaborado especialmente para contribuir a una experiencia de usuario fluida, que permita un control sin esfuerzo y una navegación fluida por la aplicación.",

        "titleViewBGMAPP": "Escucha música sin distracciones",
        "descViewBGMAPP": "Viene equipado con herramientas para integrar músicas locales y en línea, permitiendo al usuario insertar su propia música.",
        "titleShuffleBGMAPP": "Preservando características csenciales",
        "descShuffleBGMAPP": "Funcionalidad básica de cualquier jugador musico, para que no haya necesidad de reinventar la rueda y forzar cambios innecesarios.",
        "titleInputSearchBGMAPP": "¿Librería extensa? No hay problema",
        "descInputSearchBGMAPP": "Fundamentalmente diseñado considerando las grandes cantidades de música, está optimizado para librerías extensas gracias a su lazy loading y virtualización.",
        "titleContextMenuBGMAPP": "Interfaz que no recordarás",
        "descContextMenuBGMAPP": "Varias técnicas de interfaz de usuario integradas para minimizar la interferencia del usuario y simplificar la interacción.",

        "titleL2DWP": "Fondo de Pantalla Live 2D",
        "miniSummaryL2DWP": "Pantalla Live 2D",
        "summaryL2DWP": "Fondo de pantalla vivo",
        "detailsL2DWP": "Fondo de pantalla interactivo de Live2D creado usando Unity y Android Studio, que puede contener varios personajes de Live2D con los que se pueden interactuar. \n El juego funciona como un fondo de pantalla en vivo que permite a los usuarios interactuar con estos personajes al hacer clic en ellos, activando diversas emociones y líneas de voz. Aunque está diseñado principalmente para usarse como un fondo de pantalla de Android, también es compatible con versión PC y plataformas WebGL. \n Además, en la versión de Android hay unos plugins que permiten la utilización de funciones nativas de Android.",

        "titleCharacterIdleL2DWP": "Mantente conectado",
        "descCharacterIdleL2DWP": "Permite la integración como un fondo de pantalla de Android, brindando la oportunidad de disfrutar de un fondo de pantalla en vivo completamente personalizado.",
        "titleCharacterTalkL2DWP": "La interacción mejora la experiencia",
        "descCharacterTalkL2DWP": "Interactuar con el personaje de Live2D puede activar una variedad de interacciones agradables, incluyendo emociones y líneas de voz.",
        "titleCharacterUIL2DWP": "Interfaz integrada para funcionalidad",
        "descCharacterUIL2DWP": "Viene equipado con un interfaz de usuario para configurar los ajustes de Android gracias a los plugins de Android Studio.",
        "titleNextCharacterTalkL2DWP": "Experiencia personalizada",
        "descNextCharacterTalkL2DWP": "Integra sin esfuerzo cualquier personaje que soporte Live2D Cubism en el fondo de pantalla, creando una experiencia verdaderamente personal.",

        "titleSYMBIOMATA": "Proyecto Coop Realidad Virtual (PCVR)",
        "miniSummarySYMBIOMATA": "Juego Coop RV",
        "summarySYMBIOMATA": "Juego cooperativo RV asimétrico",
        "detailsSYMBIOMATA": "Juego de plataformas asimétrico en RV creado en Unity, donde el jugador de RV se encarga de las acciones con las manos y el jugador de PC se encarga de las plataformas. \n El juego cuenta con modos de juego local y en online. Esta diseñado con una arquitectura de servidor autoritativa utilizando prácticas y características estándar de la industria, como la predicción del lado del cliente para el movimiento de las manos en RV y la compensación de retraso de proyectiles, junto con relés y salas de espera para facilitar la búsqueda de partidas. \n Las imágenes incluidas fueron tomadas de partidas en online.",

        "titleSlashSYMBIOMATA": "Transciende realidades, sin importar la distancia",
        "descSlashSYMBIOMATA": "Experimenta la emoción localmente u online. Elige unirte en la misma máquina o conectarte con alguien al otro lado del mundo a través de la internet.",
        "title2DSYMBIOMATA": "Equipo es la clave a la victoria",
        "desc2DSYMBIOMATA": "El éxito depende en la colaboración. El jugador de RV se basa en el jugador de PC para recibir orientación y navegar por los peligros, mientras que el jugador de PC depende del jugador de RV para ascensión y protección contra los enemigos.",
        "titleZiplineSYMBIOMATA": "Navega juntos por escenarios únicos",
        "descZiplineSYMBIOMATA": "Embárcate en una aventura a través de una variedad de escenarios llenas de obstáculos diseñados específicamente para una cooperación fluida entre PC y RV.",
        "titleVRPovSYMBIOMATA": "Diferentes perspectivas, un viaje compartido",
        "descVRPovSYMBIOMATA": "Una experiencia de juego única que el jugador de PC controla el movimiento del personaje, mientras que el jugador de RV disfruta de un control preciso sobre el entorno 3D inmersivo utilizando los controladores XR.",

        "titleONIGIRI": "Corte de Demonions",
        "miniSummaryONIGIRI": "Juego Tipo Souls",
        "summaryONIGIRI": "Juego Unity 3D Tipo Souls",
        "detailsONIGIRI": "Juego de un solo jugador estilo Souls creado en Unity, donde el jugador debe derrotar a jefes enemigos haciéndole parry a sus ataques mientras evade simultáneamente sus proyectiles. \n La mecánica principal gira en torno al tiempo preciso, donde el jugador debe parry en sincronía con el ritmo de los ataques del enemigo. Al anticipar correctamente el ataque, el jugador puede contraatacar y desquitarse contra el enemigo.",

        "titleBossONIGIRI": "Retaliación contra adversarios formidables",
        "descBossONIGIRI": "El AI enemigo está diseñado para mejorar el desafío general y el compromiso del juego, para enfatizar una toma de decisiones instintiva basada en la situación.",
        "titleBossEntranceONIGIRI": "Embárcate en una aventura",
        "descBossEntranceONIGIRI": "Mundo elaborado con detalles de un Japón feudal de fantasía donde los demonios recorren por la tierra.",
        "titleBossParryONIGIRI": "Supera temibles obstáculos",
        "descBossParryONIGIRI": "Mecánica central enfatiza la ejecución de parries precisos contra los ataques enemigos dentro de una ventana de tiempo definida, lo que permite contraataques efectivos y retaliación contra los oponentes.",
        "titleMageONIGIRI": "Esquiva hacia la victoria",
        "descMageONIGIRI": "El éxito también depende del uso inteligente de la mecánica de esquivar, donde el uso en el tiempo preciso es crucial para lograr la victoria.",
        "titleUnblockableONIGIRI": "Sigue el ritmo de la batalla",
        "descUnblockableONIGIRI": "Los enemigos exhiben patrones de ataque únicos, lo que requiere un enfoque adaptativo, reflexivo y estratégico para superarlos de manera efectiva.",

        "titleNEKOMATA": "Nekomata",
        "miniSummaryNEKOMATA": "Juego Bullet Hell",
        "summaryNEKOMATA": "Juego Bullet Hell",
        "detailsNEKOMATA": "Juego estilo boss rush bullet hell creado en Unreal Engine 5, inspirado en la serie icónica de bullet hell, Touhou. \n La mecánica central del juego es la habilidad de rewind, que permite al jugador esquivar los proyectiles de los enemigos, pero a consecuencia obliga a volver hacia una posición anterior que podría ser vulnerable. \n El juego presenta jefes con proyectiles inevitables para incentivar el uso constante, manteniendo al mismo tiempo un aspecto de alto riesgo/alta recompensa.",

        "titleTutorialNEKOMATA": "Protocolo rewind",
        "descTutorialNEKOMATA": "Mecánica central del juego, donde el rewind se puede utilizar para volverse invulnerable a costa de regresar a una ubicación anterior, el uso estratégico es necesario para maximizar su beneficio.",
        "titleBossFightNEKOMATA": "Adversarios desafiantes",
        "descBossFightNEKOMATA": "Cada jefe presenta un patrón de proyectiles único, con múltiples fases que se vuelven más desafiantes y atractivas a medida que avanza el nivel.",
        "titleMinionFightNEKOMATA": "Música sincronizada Inmersiva",
        "descMinionFightNEKOMATA": "Sistema de audio extenso diseñado para sincronizar varios escenarios con la música, proporcionando una experiencia de juego completamente inmersiva.",
        "titlePlagueRatBossNEKOMATA": "Juego implacable",
        "descPlagueRatBossNEKOMATA": "Modo de juego desafiante en el que el jugador debe participar en una batalla de estrategia, en la cual el conocimiento y la habilidad se convierten en la clave para vencer a formidables adversarios.",

        "titleBURROUGHS": "BURROUGHS",
        "miniSummaryBURROUGHS": "WebRTC Player",
        "SummaryBURROUGHS": "WebRTC Player",
        "detailsBURROUGHS": "b1lah blah blah",
        
        "titlePORTFOLIO": "Portafolio",
        "miniSummaryPORTFOLIO": "React Web",
        "summaryPORTFOLIO": "Pagina Web React",
        "detailsPORTFOLIO": "Portafolio creado enteramente usando React, TypeScript y Tailwind CSS, que sirve como una ventana para una selección de proyectos que he creado y trabajado con pasión, marcando una época significativa en mi trayectoria de desarrollo. \n Cada proyecto presentado refleja mis habilidades y creatividad, demostrando un compromiso con la calidad y la usabilidad. \n Gracias por tomarte el tiempo de explorar mi portafolio. Aprecio mucho el interés en mi trabajo, ya que estoy apasionado por compartir mis habilidades y proyectos. \n ¡MUCHAS GRACIAS!",

        "demo": "Probar demo",
        "demoError": "Demo no disponible",

        "error": "La página que estas buscando no existe. Por favor verifique el URL o váyase para la página hogar."
    
    },

    "ja": {
        "spanish": "スペイン語",
        "english": "英語",
        "japanese": "日本語",

        "home": "ホーム",
        "projects": "プロジェクト",
        "contacts":"連絡",

        "greetings": "いらっしゃいませ！",
        "intro": "僕のフルネームは <fn> <ln1> <ln2> \n <pn>と呼んでいただいてもいいです",

        "aboutHeader": "僕のこと",
        "about": "プエルトリコ大学バヤモン校のコンピュータサイエンス専攻の学生、現在の経験年は<years>年ぐらいです 。\n 僕の旅は高校時代から始まったし、ビデオゲームの研究チームに積極的に参加したころ、さまざまなエンジンを使ってさまざまなゲームを開発しました。\n また、いくつかの情熱的なプロジェクトに参加したことで、ソフトウェア開発プロセスにおける貴重な洞察と実践的な経験を得ることができました。余暇を利用した継続的な学習とスキルアップに努め、あらゆる成長機会を最大限に生かせるよう努力しています。",

        "skills": "スキル一覧",
        "skillsLang": "プログラミング言語",
        "skillsTools": "ツール",
        "skillsGame": "ゲーム",
        "skillsWeb": "ウェブ",
                
        "projectList": "プロジェクト一覧",

        "viewPage": "ページを見る",

        "demoHeader": "デモ",
        "videoHeader": "ビデオ",
        "linksHeader": "リンク",

        "resume": "レジュメ",
        "email": "メール",
        "sourceCode": "ソースコード",

        "download": "ダウンロード",
        "website": "ウェブサイト",

        "titleBGMAPP": "ビージーエムアプリ",
        "miniSummaryBGMAPP": "音楽プレイヤー",
        "summaryBGMAPP": "背景音楽プレイヤー",
        "detailsBGMAPP": "ElectronとViteを使用して作られたトラックプレーヤー、ローカルディレクトリまたはオンラインソースから直接取得した音楽トラックを再生する機能を持ちあげております。\nトラックプレーヤーは、プレーヤーの状態を効果的に制御・管理するために戦略的に配置された直感的なユーザーインターフェイスを備えています。また、仮想化やレイジーローディングによる様々な最適化のトリックも含まれています。\nデザインは、特にシームレスなユーザーエクスペリエンスに貢献するために徹底的に作り込まれ、アプリケーション全体を通して楽なコントロールとスムーズなナビゲーションを可能にしています。",

        "titleViewBGMAPP": "音楽を気軽に聴く",
        "descViewBGMAPP": "ローカルとオンライントラックを統合するためのツールが装備されており、ユーザーが自分の音楽を挿入できるようになっています。",
        "titleShuffleBGMAPP": "基本的な機能を保持",
        "descShuffleBGMAPP": "典型的なトラックプレーヤーの基本機能で、再発明する必要がなく、不要な変更を強いることがありません。",
        "titleInputSearchBGMAPP": "大きなライブラリ？問題なし",
        "descInputSearchBGMAPP": "大量のトラックを考慮して基本的に設計されており、レイジーローディングと仮想化のおかげで広範なライブラリに最適化されています。",
        "titleContextMenuBGMAPP": "記憶に残らないUI",
        "descContextMenuBGMAPP": "ユーザーの干渉を最小限に抑え、インタラクションを簡素化するために統合されたさまざまなUI技術。",

        "titleL2DWP": "Live2Dウォールペーパー",
        "miniSummaryL2DWP": "ライブ壁紙",
        "summaryL2DWP": "インタラクティブLive2D壁紙",
        "detailsL2DWP": "UnityとAndroid Studioで作成されたインタラクティブなLive2D壁紙で、さまざまなLive2Dキャラクターとインタラクトすることができます。このゲームはライブ壁紙として機能し、ユーザーがキャラクターをクリックすることで、さまざまな感情やボイスラインを引き出すことができます。主にAndroidの壁紙として使用するように設計されていますが、PCやWebGLプラットフォームにも対応しています。さらに、Android版はネイティブAndroid機能を利用するためのプラグインをサポートしています。",

        "titleCharacterIdleL2DWP": "つながりを保つ",
        "descCharacterIdleL2DWP": "Androidの壁紙としての統合を可能にし、完全にカスタマイズされたライブ壁紙を楽しむことができます。",
        "titleCharacterTalkL2DWP": "インタラクションが体験を向上させる",
        "descCharacterTalkL2DWP": "Live2Dキャラクターとインタラクトすることで、動きやボイスラインを含むさまざまな楽しいインタラクションが可能です。",
        "titleCharacterUIL2DWP": "機能のための統合UI",
        "descCharacterUIL2DWP": "Android Studioのプラグインのおかげで、Androidの設定を構成するためのUIが装備されています。",
        "titleNextCharacterTalkL2DWP": "パーソナライズされた体験",
        "descNextCharacterTalkL2DWP": "Live2D Cubismをサポートする任意のキャラクターを壁紙に簡単に統合し、真に個人的な体験を作り出します。",

        "titleSYMBIOMATA": "シンビオマタ",
        "miniSummarySYMBIOMATA": "協力プレイVRゲーム",
        "summarySYMBIOMATA": "非対称協力プレイVRゲーム",
        "detailsSYMBIOMATA": "Unityで作成された非対称VR協力プラットフォーマーで、VRプレイヤーが手の動作を担当し、PCプレイヤーがプラットフォームを担当します。\n ゲームはローカルおよびオンラインのゲームモードの両方を備えています。オンラインモードは、VRの手の動きに対するクライアント側の予測や弾道の遅延補償など、業界標準のプラクティスと機能を使用したサーバー権限のアーキテクチャで設計されています。また、マッチメイキングを容易にするためのリレーやロビーも備えています。\n 含まれている映像は、実際のオンラインゲームプレイから撮影されたものです。",

        "titleSlashSYMBIOMATA": "距離に関係なく現実を超越する",
        "descSlashSYMBIOMATA": "ローカルまたはオンラインでスリルを味わうことができます。同じ機械でローカルを組むか、インターネットを通じて世界中の誰かとつながることができます。",
        "title2DSYMBIOMATA": "勝利の鍵はチームワーク",
        "desc2DSYMBIOMATA": "成功は協力にかかっています。VRプレイヤーはPCプレイヤーの指導を頼りに危険を回避し、PCプレイヤーはVRプレイヤーに登ることや脅威からの保護を依存します。",
        "titleZiplineSYMBIOMATA": "ユニークなステージを一緒にナビゲート",
        "descZiplineSYMBIOMATA": "PCとVRの協力がシームレスに行えるように特別に設計された障害物が満載のさまざまなステージを通じて冒険できます。",
        "titleVRPovSYMBIOMATA": "異なる視点、共有された旅",
        "descVRPovSYMBIOMATA": "PCプレイヤーがキャラクターの動きを制御し、VRプレイヤーがXRコントローラーを使用して没入型の3D環境を正確に制御できるユニークなゲームプレイ体験できます。",

        "titleONIGIRI": "鬼切り",
        "miniSummaryONIGIRI": "ソウルライクゲーム",
        "summaryONIGIRI": "ソウルライクゲーム",
        "detailsONIGIRI": "Unityで作成されたソウルライクのシングルプレイヤーゲームは、プレイヤーは強力なボスを攻撃をかわしながらパリィして倒さなければなりません。\n 基本的なメカニクスは正確なタイミングに基づいており、プレイヤーは敵の攻撃のリズムに合わせてパリィを行う必要があります。攻撃を正しく予測することで、プレイヤーは敵に対して成功裏に反撃することができます。",

        "titleBossONIGIRI": "強力な敵に対して反撃する",
        "descBossONIGIRI": "敵のAIは、状況に基づいた本能的な意思決定を用いて、ゲーム全体の挑戦と没入感を高めるように設計されています。",
        "titleBossEntranceONIGIRI": "冒険に出かけよう",
        "descBossEntranceONIGIRI": "悪魔が徘徊するファンタジーの封建日本の豊かな詳細で作られた世界。",
        "titleBossParryONIGIRI": "恐ろしい障害を克服する",
        "descBossParryONIGIRI": "コアメカニクスは、定義されたタイミングウィンドウ内で敵の攻撃に対して正確なパリィを実行することを強調し、効果的な反撃と敵への報復を可能にします。",
        "titleMageONIGIRI": "攻撃を躱しながら勝利を収める",
        "descMageONIGIRI": "成功は、回避メカニクスの賢い使用にも依存しており、正確な使用が勝利を達成するために重要です。",
        "titleUnblockableONIGIRI": "戦いのリズムに乗る",
        "descUnblockableONIGIRI": "敵は独自の攻撃パターンを示し、効果的に克服するためには適応的で思慮深く戦略的なアプローチが必要です。",

        "titleNEKOMATA": "ネコマタ",
        "miniSummaryNEKOMATA": "弾幕シューティング",
        "summaryNEKOMATA": "弾幕シューティング",
        "detailsNEKOMATA": "Unreal Engine 5で作成されたボスラッシュの弾幕シューティングゲームで、アイコニックなトップダウン弾幕シューティング「東方Project」にインスパイアされています。\n ゲームのコアメカニクスはリワインド能力で、これによりプレイヤーは敵の攻撃してくる弾を回避することができ、結果として以前の脆弱な位置に戻ることになります。\n このゲームは、常に使用を促すために避けられない弾を持つボスを特徴としており、高リスク・高リターンの要素も維持しています。",

        "titleTutorialNEKOMATA": "プロトコル・リワインド",
        "descTutorialNEKOMATA": "ゲームのコアメカニクスで、リワインドを使用することで以前の位置に戻りながら無敵になることができ、その利点を最大限に活かすために戦略的な使用が促されます。",
        "titleBossFightNEKOMATA": "挑戦的な敵",
        "descBossFightNEKOMATA": "各ボスは独自の弾幕パターンを持ち、ステージが進むにつれて複数のフェーズがあり、より挑戦的で魅力的になります。",
        "titleMinionFightNEKOMATA": "没入型の同期音楽",
        "descMinionFightNEKOMATA": "さまざまなシナリオを音楽と同期させるために構築された広範なオーディオシステムにより、完全に没入できるゲームプレイです。",
        "titlePlagueRatBossNEKOMATA": "挑戦的なゲームプレイ",
        "descPlagueRatBossNEKOMATA": "プレイヤーは知識とスキルを駆使して強力な敵を克服するための知恵比べに挑む、挑戦的なゲームプレイです。",

        "titleBURROUGHS": "BURROUGHS",
        "miniSummaryBURROUGHS": "WebRTC Player",
        "SummaryBURROUGHS": "WebRTC Player",
        "detailsBURROUGHS": "b1lah blah blah",
        
        "titlePORTFOLIO": "ポートフォリオ",
        "miniSummaryPORTFOLIO": "React ウェブサイト",
        "summaryPORTFOLIO": "React ウェブサイト",
        "detailsPORTFOLIO": "React、Typescript、Tailwind CSSを使用して制作されたポートフォリオウェブサイトは、僕が情熱を持って制作に取り組んだプロジェクトの数々を紹介するショーケースの役割を果たし、僕の開発人生の重要なマイルストーンとなりました。\n 各プロジェクトは、僕のスキルと創造性を反映し、品質とユーザビリティへのコミットメントを示しています。\n 僕のポートフォリオをご覧いただき、ありがとうございます。僕のスキルやプロジェクトを分かち合いたいので、僕の作品に関心を持っていただき、とても感謝しています。\n 本当にありがとうございました！",

        "demo": "体験デモ",
        "demoError": "デモが不利用",

        "error": "探しているページが存在しません。また、「URL」にエラーがあるかも。再度確認していただくか、ホームページに戻るか。"
    }
}