{
    "en": {
        "spanish": "Spanish",
        "english": "English",
        "japanese": "Japanese",

        "home": "Home",
        "projects": "Projects",
        "contacts":"Contacts",

        "greetings": "Greetings!",
        "intro": "My name is <fn> <ln1> <ln2> \n I also go by <pn>",
        
        "aboutHeader": "About Me",
        "about": "Graduate student from the University of Puerto Rico Bayamon and dedicated Software Engineer with approximately <years> years of experience in UI/UX Design, game development, and web development. \nActively participated in a video game research team, where we developed various games using different engines, tools, and technologies for competitive game development events. \nAdditionally, engaged in several passion projects that provided invaluable insights and hands-on experience in the software development process, demonstrating my commitment to continuous learning and skill enhancement in my spare time while striving to maximize every opportunity for growth.",
        
        "skills": "Technical Skills",
        "skillsLang": "Languages",
        "skillsTools": "Tools",
        "skillsGame": "Game",
        "skillsWeb": "Web",
        
        "projectList": "Projects",

        "viewPage": "View Page",

        "demoHeader": "Demo",
        "videoHeader": "Preview",
        "linksHeader": "Links",
        
        "resume": "Resume",
        "email": "Email",
        "sourceCode": "Source Code",

        "titleBGMAPP": "Background Music Application",
        "miniSummaryBGMAPP": "Music Player",
        "summaryBGMAPP": "Electron Music Player",
        "detailsBGMAPP": "Music application developed using Electron and Vite, designed to play music tracks sourced from both local directories and online platforms. \nThe app features an intuitive user interface, strategically designed to provide effective control and management of the player's state. \nWith optimizations such as virtualization and lazy loading, it ensures a seamless user experience, allowing for effortless control and smooth navigation throughout the application.",

        "titleViewBGMAPP": "Listen to music without distractions",
        "descViewBGMAPP": "A music player designed to play music, no matter the format, nor the source, allowing users to enjoy their music.",
        "titleActionBGMAPP": "Preserving essential features",
        "descActionBGMAPP": "Basic functionality of any typical music player, so that there is no need to reinvent the wheel, and unnecessarily force change.",
        "titleSearchBGMAPP": "Big library? No problem",
        "descSearchBGMAPP": "Fundamentally set into consideration the large quantities of tracks, it is optimized for extensive libraries thanks to its lazy loading and virtualization.",
        "titleLightThemeBGMAPP": "Essential Utilities",
        "descLightThemeBGMAPP": "Equipped with essential utilities to enhance the user experience, such as changing the theme, selecting the desired language, downloading an online track, or selecting a home directory to play its tracks.",
        "titleResponsiveBGMAPP": "UI that you won’t remember",
        "descResponsiveBGMAPP": "Various UI techniques are integrated to minimize user interference and simplify interaction.",

        "titleL2DWP": "Live 2D Wallpaper",
        "miniSummaryL2DWP": "Live Wallpaper",
        "summaryL2DWP": "Interactive Live 2D Wallpaper",
        "detailsL2DWP": "Interactable Live2D wallpaper developed using Unity and Android Studio, featuring Live2D characters that users can interact with. \nThis game functions as a live wallpaper that allows engagement with the characters through gestures and touch motions, triggering a range of emotions and functionalities. \nDesigned primarily for Android, the app enables native interactions with Android features. It is also compatible with PC and WebGL platforms, broadening its accessibility.",

        "titleCharacterIdleL2DWP": "Stay connected",
        "descCharacterIdleL2DWP": "Enables integration as an Android wallpaper, providing the opportunity to enjoy a fully customized live wallpaper.",
        "titleCharacterTalkL2DWP": "Engagement enhances experience",
        "descCharacterTalkL2DWP": "Interacting with the Live2D character can activate a range of delightful interactions, including emotions and voice lines.",
        "titleCharacterUIL2DWP": "Integrated UI for functionality",
        "descCharacterUIL2DWP": "Comes equipped with UI to configurate settings of the Android thanks to its Android Studio plugins.",
        "titleNextCharacterTalkL2DWP": "Personalized experience",
        "descNextCharacterTalkL2DWP": "Effortlessly integrate any character that supports Live2D Cubism to the wallpaper, creating a truly personal experience",

        "titleSYMBIOMATA": "SYMBIOMATA",
        "miniSummarySYMBIOMATA": "VR Coop Game",
        "summarySYMBIOMATA": "Asymmetrical VR Coop Game",
        "detailsSYMBIOMATA": "Asymmetrical VR coop platformer made in Unity, where the VR player is in charge of hand actions and the PC player is in charge of platforming. \n The game features both local and online game modes. The latter of which is designed with a server-authoritative architecture using standard industry practices and features, such as client-side prediction for VR hand movement and projectile lag compensation, along with relay and lobbies for easy matchmaking. \n Footage included was taken from real online gameplay.",

        "titleSlashSYMBIOMATA": "Transcend realities, no matter the distance",
        "descSlashSYMBIOMATA": "Experience the thrill locally or online. Choose to team up on the same machine or connect with someone across the globe over the internet.",
        "title2DSYMBIOMATA": "Teamwork is the key to victory",
        "desc2DSYMBIOMATA": "Success hinges on collaboration. The VR player relies on the PC player for guidance to navigate dangers, while the PC player depends on the VR player for ascension and protection against threats.",
        "titleZiplineSYMBIOMATA": "Navigate unique stages together",
        "descZiplineSYMBIOMATA": "Embark on an adventure through a variety of stages filled with obstacles specifically designed for seamless PC and VR cooperation.",
        "titleVRPovSYMBIOMATA": "Different perspectives, one shared journey",
        "descVRPovSYMBIOMATA": "Unique gameplay experience by allowing the PC player to control the character's movement while the VR player enjoys precise control over the immersive 3D environment using the XR controllers.",

        "titleONIGIRI": "ONIGIRI",
        "miniSummaryONIGIRI": "Souls-like Game",
        "summaryONIGIRI": "Unity 3D Souls-like Game",
        "detailsONIGIRI": "Souls-like single-player game developed in Unity, where players face formidable bosses in intense combat. The gameplay centers around a precise parrying mechanic, requiring players to time their parries perfectly to counter enemy attacks and create opportunities for retaliation. \nMastering the timing of both parries and evasion is essential for survival, as quick reactions are necessary to turn the tide of battle. \nEach encounter demands skill and strategy, challenging players to navigate the balance between evasion and counterattacking.",

        "titleBossONIGIRI": "Retaliate against formidable adversaries",
        "descBossONIGIRI": "Enemy AI designed to enhance the overall challenge and engagement of the game, to incentivize decision making based on the situation.",
        "titleBossEntranceONIGIRI": "Embark on an adventure",
        "descBossEntranceONIGIRI": "World crafted with rich details of a fantasy feudal Japan where demons roam the land.",
        "titleBossParryONIGIRI": "Overcome fearsome obstacles",
        "descBossParryONIGIRI": "Core mechanic emphasizing the execution of precise parries against enemy attacks within a defined timing window, enabling effective counterattacks and retaliation against the opponents.",
        "titleMageONIGIRI": "Dodge your way to victory",
        "descMageONIGIRI": "Success also hinges on smart use of the dodging mechanic, where precise use is crucial for achieving victory.",
        "titleUnblockableONIGIRI": "Ride the rhythm of battle",
        "descUnblockableONIGIRI": "Enemies exhibit unique attack patterns, necessitating an adaptive, thoughtful, and strategic approach to effectively overcome.",

        "titleNEKOMATA": "NEKOMATA",
        "miniSummaryNEKOMATA": "BulletHell Game",
        "summaryNEKOMATA": "Bullet Hell Game",
        "detailsNEKOMATA": "Boss rush bullet hell game developed in Unreal Engine 5, drawing inspiration from the iconic Touhou series. Players will face a series of challenging bosses, each designed with unique patterns and unavoidable projectiles that encourage the strategic use of the core rewind mechanic. \nThis rewind ability allows to dodge incoming attacks by rewinding to a previous position, creating a high-stakes environment where every movement and decision counts. \nWith a focus on high risk/high reward gameplay, the challenge arrives in mastering reflexes and timing to navigate intricate bullet patterns.",

        "titleTutorialNEKOMATA": "Protocol Rewind",
        "descTutorialNEKOMATA": "Core mechanic of the game, where rewinding can be used to become invulnerable at the cost of going to a previous location, encouraging strategic use to maximize its benefits.",
        "titleBossFightNEKOMATA": "Challenging adversaries",
        "descBossFightNEKOMATA": "Every boss contains a unique bullet pattern, with multiple phases that as the stage progresses becomes more challenging and engaging.",
        "titleMinionFightNEKOMATA": "Immersive synchronized music",
        "descMinionFightNEKOMATA": "Extensive audio system built around synchronizing various scenarios with the music, providing a fully immersive gameplay experience. ",
        "titlePlagueRatBossNEKOMATA": "Unforgiving gameplay",
        "descPlagueRatBossNEKOMATA": "Challenging gameplay where the player must engage in a battle of wits, where knowledge and skill become the key to overcome formidable adversaries.",
        
        "titleTSUKUMO": "TSUKUMO TEMPO",
        "miniSummaryTSUKUMO": "Rhythm Game",
        "summaryTSUKUMO": "Rhythm Action Game",
        "detailsTSUKUMO": "Rhythm-action game developed in Unreal Engine 5, where players must synchronize their actions with the pulsating musical beat. \nThe gameplay introduces a unique cassette tape mechanic, where each action performed either depletes or replenishes the tape of the cassette, adding a strategic layer to the rhythm experience. \nEvaluation of the risk and reward is key, as managing the cassette tape becomes crucial to success. Every animation and action are intricately tied to the rhythm, creating a seamless blend of music and gameplay that immerses in a dynamic audio-visual action experience.",

        "titleAmanoTSUKUMO": "Rhythm Flow",
        "descAmanoTSUKUMO": "Every animation and action are intricately tied to the rhythm, creating a seamless blend of music and gameplay that immerses in a dynamic audio-visual action experience.",
        "titleRinTSUKUMO": "Combine the Rhythm",
        "descRinTSUKUMO": "Each action performed by the player grants a note, in which a combination of notes grants the ability to use special attacks.",
        "titleKurikoTSUKUMO": "Feel the Rhythm",
        "descKurikoTSUKUMO": "The theme of the game consists of a combination of future-neon era, and delinquent girls ready to combat against anyone that dare challenge them.",

        "titleBURROUGHS": "BURROUGHS",
        "miniSummaryBURROUGHS": "WebRPC Player",
        "summaryBURROUGHS": "WebRPC Player",
        "detailsBURROUGHS": "Work-in-progress RPC player created using React, Node.js, and MongoDB, which allows users to host a lobby where others can join. \nThis hosted lobby facilitates communication between users and enables synchronized music playback from YouTube, Spotify, and SoundCloud, thanks to a public open-sourced reversed-engineered API.",

        "titleREMU": "Natsuki Remu",
        "miniSummaryREMU": "Discord Bot",
        "summaryREMU": "Discord Music Bot",
        "detailsREMU": "Discord bot built using the Discord.py and Lavaplayer API, allowing users to execute external commands within a Discord server. \nThis bot serves as a music player that allows users to listen to uninterrupted music from platforms such as YouTube, Spotify, and SoundCloud. \nAdditionally, the bot integrates a pre-trained large language model with a locally hosted Raspberry Pi Ollama server.",
        
        "titlePlayREMU": "Hear the Music",
        "descPlayREMU": "Play and hear any music that you desire from anywhere from YouTube to Spotify in the comfort of your discord server.",
        "titleSkipREMU": "Skip the Music",
        "descSkipREMU": "Any music that you don’t want to hear can be skippable with as easy as a single command.",
        "titleQueueREMU": "See the Playlist",
        "descQueueREMU": "With the capabilities of this bot, playing huge playlist, and/or huge albums is as easy as pie.",
        "titleShuffleREMU": "Shuffle the Playlist",
        "descShuffleREMU": "Randomize your loaded playlist for a bit of randomness.",

        "titlePORTFOLIO": "Portfolio",
        "miniSummaryPORTFOLIO": "React Website",
        "summaryPORTFOLIO": "React Website",
        "detailsPORTFOLIO": "Portfolio website created entirely using React, Typescript, and Tailwind CSS, which serves as a showcase for a selection of projects that I have passionately created and worked on, marking a significant milestone in my development journey. \n Each project presented reflects my skills and creativity, demonstrating a commitment to quality and usability. \n Thank you for taking the time to explore my portfolio. Interest in my work is greatly appreciated, as I am eager to share my skills and projects. \n THANK YOU VERY MUCH!",

        "demo": "Try Demo",
        "demoError": "No Demo Available",

        "error": "The page you are looking for does not seem to exist. Please check the URL or navigate to the homepage."
    },

    "es": {
        "spanish": "Español",
        "english": "Inglés",
        "japanese": "Japonés",

        "home": "Hogar",
        "projects": "Proyectos",
        "contacts":"Contactos",

        "greetings": "¡Bienvenidos!",
        "intro": "Me llamo <fn> <ln1> <ln2> \n También uso <pn>",

        "aboutHeader": "Sobre mí",
        "about": "Estudiante graduado de la Universidad de Puerto Rico Bayamón y dedicado Software Engineer con aproximadamente <years> años de experiencia en diseño UI/UX, desarrollador de video juegos, y desarrollador de web. \nParticipé activamente en un equipo de investigación de videojuegos, donde se desarrollaron varios juegos utilizando diferentes engines, herramientas y tecnologías. \nAdemás, me involucré en varios proyectos personales que proporcionaron valiosas perspectivas y experiencia práctica en el proceso de desarrollo de software, demostrando mi compromiso con el aprendizaje continuo y la mejora de habilidades en mi tiempo libre, mientras me esfuerzo por maximizar cada oportunidad de crecimiento.",

        "skills": "Destrezas",
        "skillsLang": "Lenguajes",
        "skillsTools": "Tools",
        "skillsGame": "Juego",
        "skillsWeb": "Web",

        "projectList": "Proyectos",

        "viewPage": "Ver Pagina",

        "demoHeader": "Demo",
        "videoHeader": "Video",
        "linksHeader": "Enlaces",

        "resume": "Resume",
        "email": "Email",
        "sourceCode": "Source Code",

        "titleBGMAPP": "Aplicación de Música Ambiental",
        "miniSummaryBGMAPP": "Jugador Musico",
        "summaryBGMAPP": "Jugador Musico Electron",
        "detailsBGMAPP": "Aplicación de música creado utilizando Electron y Vite, diseñada para escuchar músicas provenientes tanto de directorios locales como de plataformas en línea. \nLa aplicación cuenta con una interfaz de usuario intuitiva, diseñada estratégicamente para proporcionar un control y gestión efectivos del estado del reproductor. \nCon optimizaciones como la virtualización y lazy loading, garantiza una experiencia de usuario fluida, permitiendo un control sin esfuerzo y una navegación suave a lo largo de la aplicación.",

        "titleViewBGMAPP": "Escucha música sin distracciones",
        "descViewBGMAPP": "Una aplicación de música diseñado para escuchar música no importa el formato, ni de donde es, dejando a los usuarios disfrutar de su música.",
        "titleActionBGMAPP": "Preservando características csenciales",
        "descActionBGMAPP": "Funcionalidad básica de cualquier jugador musico, para que no haya necesidad de reinventar la rueda y forzar cambios innecesarios.",
        "titleSearchBGMAPP": "¿Librería extensa? No hay problema",
        "descSearchBGMAPP": "Fundamentalmente diseñado considerando las grandes cantidades de música, está optimizado para librerías extensas gracias a su lazy loading y virtualización.",
        "titleLightThemeBGMAPP": "Utilidades esenciales",
        "descLightThemeBGMAPP": "Equipado con utilidades esenciales para mejorar la experiencia del usuario, como cambiar el tema, seleccionar el idioma deseado, descargar música o seleccionar un directorio de inicio para disfrutar de la música.",
        "titleResponsiveBGMAPP": "Interfaz que no recordarás",
        "descResponsiveBGMAPP": "Varias técnicas de interfaz integradas para minimizar la interferencia del usuario y simplificar la interacción.",

        "titleL2DWP": "Fondo de Pantalla Live 2D",
        "miniSummaryL2DWP": "Wallpaper Live 2D",
        "summaryL2DWP": "Wallpaper vivo interactivo",
        "detailsL2DWP": "Wallpaper interactivo creado utilizando Unity y Android Studio, que presenta personajes Live2D con los que los usuarios pueden interactuar. \nEste juego funciona como un wallpaper vivo que permite la interacción con los personajes a través de gestos y movimientos touch, en cual activa una variedad de emociones y funcionalidades. \nDiseñada principalmente para Android, la aplicación permite interacciones nativas de Android. También es compatible con plataformas de PC y WebGL, ampliando su accesibilidad.",

        "titleCharacterIdleL2DWP": "Mantente conectado",
        "descCharacterIdleL2DWP": "Permite la integración como un fondo de pantalla de Android, brindando la oportunidad de disfrutar de un fondo de pantalla en vivo completamente personalizado.",
        "titleCharacterTalkL2DWP": "La interacción mejora la experiencia",
        "descCharacterTalkL2DWP": "Interactuar con el personaje de Live2D puede activar una variedad de interacciones agradables, incluyendo emociones y líneas de voz.",
        "titleCharacterUIL2DWP": "Interfaz integrada para funcionalidad",
        "descCharacterUIL2DWP": "Viene equipado con un interfaz de usuario para configurar los ajustes de Android gracias a los plugins de Android Studio.",
        "titleNextCharacterTalkL2DWP": "Experiencia personalizada",
        "descNextCharacterTalkL2DWP": "Integra sin esfuerzo cualquier personaje que soporte Live2D Cubism en el fondo de pantalla, creando una experiencia verdaderamente personal.",

        "titleSYMBIOMATA": "SYMBIOMATA",
        "miniSummarySYMBIOMATA": "Juego Coop RV",
        "summarySYMBIOMATA": "Juego cooperativo RV asimétrico",
        "detailsSYMBIOMATA": "Juego de plataformas asimétrico en RV creado en Unity, donde el jugador de RV se encarga de las acciones con las manos y el jugador de PC se encarga de las plataformas. \n El juego cuenta con modos de juego local y en online. Esta diseñado con una arquitectura de servidor autoritativa utilizando prácticas y características estándar de la industria, como la predicción del lado del cliente para el movimiento de las manos en RV y la compensación de retraso de proyectiles, junto con relés y salas de espera para facilitar la búsqueda de partidas. \n Las imágenes incluidas fueron tomadas de partidas en online.",

        "titleSlashSYMBIOMATA": "Transciende realidades, sin importar la distancia",
        "descSlashSYMBIOMATA": "Experimenta la emoción localmente u online. Elige unirte en la misma máquina o conectarte con alguien al otro lado del mundo a través de la internet.",
        "title2DSYMBIOMATA": "Equipo es la clave a la victoria",
        "desc2DSYMBIOMATA": "El éxito depende en la colaboración. El jugador de RV se basa en el jugador de PC para recibir orientación y navegar por los peligros, mientras que el jugador de PC depende del jugador de RV para ascensión y protección contra los enemigos.",
        "titleZiplineSYMBIOMATA": "Navega juntos por escenarios únicos",
        "descZiplineSYMBIOMATA": "Embárcate en una aventura a través de una variedad de escenarios llenas de obstáculos diseñados específicamente para una cooperación fluida entre PC y RV.",
        "titleVRPovSYMBIOMATA": "Diferentes perspectivas, un viaje compartido",
        "descVRPovSYMBIOMATA": "Una experiencia de juego única que el jugador de PC controla el movimiento del personaje, mientras que el jugador de RV disfruta de un control preciso sobre el entorno 3D inmersivo utilizando los controladores XR.",

        "titleONIGIRI": "ONIGIRI",
        "miniSummaryONIGIRI": "Juego Tipo Souls",
        "summaryONIGIRI": "Juego Unity 3D Tipo Souls",
        "detailsONIGIRI": "Juego estilo “souls-like” creado en Unity, donde los jugadores se enfrentan a boses formidables en combates intensos. \nLa jugabilidad se centra en una mecánica de parry precisa, que requiere que los jugadores cronometran sus parries a la perfección para contrarrestar los ataques enemigos y crear oportunidades para retaliación. Dominar los parries y evasión es esencial para la supervivencia, ya que se necesitan reacciones rápidas para cambiar el rumbo de la batalla. \nCada encuentro exige habilidad y estrategia, desafiando a los jugadores a navegar el equilibrio entre la evasión y el contraataque.",

        "titleBossONIGIRI": "Retaliación contra adversarios formidables",
        "descBossONIGIRI": "El AI enemigo está diseñado para mejorar el desafío general y el compromiso del juego, para enfatizar una toma de decisiones instintiva basada en la situación.",
        "titleBossEntranceONIGIRI": "Embárcate en una aventura",
        "descBossEntranceONIGIRI": "Mundo elaborado con detalles de un Japón feudal de fantasía donde los demonios recorren por la tierra.",
        "titleBossParryONIGIRI": "Supera temibles obstáculos",
        "descBossParryONIGIRI": "Mecánica central enfatiza la ejecución de parries precisos contra los ataques enemigos dentro de una ventana de tiempo definida, lo que permite contraataques efectivos y retaliación contra los oponentes.",
        "titleMageONIGIRI": "Esquiva hacia la victoria",
        "descMageONIGIRI": "El éxito también depende del uso inteligente de la mecánica de esquivar, donde el uso en el tiempo preciso es crucial para lograr la victoria.",
        "titleUnblockableONIGIRI": "Sigue el ritmo de la batalla",
        "descUnblockableONIGIRI": "Los enemigos exhiben patrones de ataque únicos, lo que requiere un enfoque adaptativo, reflexivo y estratégico para superarlos de manera efectiva.",

        "titleNEKOMATA": "NEKOMATA",
        "miniSummaryNEKOMATA": "Juego Bullet Hell",
        "summaryNEKOMATA": "Juego Bullet Hell",
        "detailsNEKOMATA": "Juego de estilo boss rush de bullet hell creado en Unreal Engine 5, inspirado en la serie icónica de “Touhou”. Los jugadores se enfrentarán a una serie de boses desafiantes, cada uno diseñado con patrones únicos y proyectiles inevitables que fomentan el uso estratégico de la mecánica central del “Rewind”. \nEsta habilidad de rewind permite esquivar ataques entrantes rebobinando a una posición anterior, creando un entorno de alto riesgo donde cada movimiento y decisión cuenta. Con un enfoque en la jugabilidad de alto riesgo/alta recompensa, el desafío consiste en dominar los reflejos para sortear intrincados patrones de balas.",

        "titleTutorialNEKOMATA": "Protocolo Rewind",
        "descTutorialNEKOMATA": "Mecánica central del juego, donde el rewind se puede utilizar para volverse invulnerable a costa de regresar a una ubicación anterior, el uso estratégico es necesario para maximizar su beneficio.",
        "titleBossFightNEKOMATA": "Adversarios desafiantes",
        "descBossFightNEKOMATA": "Cada jefe presenta un patrón de proyectiles único, con múltiples fases que se vuelven más desafiantes y atractivas a medida que avanza el nivel.",
        "titleMinionFightNEKOMATA": "Música sincronizada Inmersiva",
        "descMinionFightNEKOMATA": "Sistema de audio extenso diseñado para sincronizar varios escenarios con la música, proporcionando una experiencia de juego completamente inmersiva.",
        "titlePlagueRatBossNEKOMATA": "Juego implacable",
        "descPlagueRatBossNEKOMATA": "Modo de juego desafiante en el que el jugador debe participar en una batalla de estrategia, en la cual el conocimiento y la habilidad se convierten en la clave para vencer a formidables adversarios.",

        "titleTSUKUMO": "TSUKUMO TEMPO",
        "miniSummaryTSUKUMO": "Juego Ritmico",
        "summaryTSUKUMO": "Juego de Acción Rítmica",
        "detailsTSUKUMO": "Juego de ritmo y acción desarrollado en Unreal Engine 5, donde los jugadores deben sincronizar sus acciones con el pulso musical. \nEl juego introduce una mecánica única de casete, donde cada acción realizada ya sea agota o repone la cinta del casete, añadiendo una capa estratégica a la experiencia rítmica. \nLa evaluación del riesgo y la recompensa es clave, ya que manejar la cinta del casete se vuelve crucial para el éxito. La música se sincroniza con las acciones realizadas, lo que proporciona una experiencia de acción dinámica.",

        "titleAmanoTSUKUMO": "Ritmo Fluyente",
        "descAmanoTSUKUMO": "Cada animación y acción esta conectado el ritmo de la música, creando una mezcla fluida de música y jugabilidad que sumerge al jugador en una experiencia dinámica de acción audiovisual.",
        "titleRinTSUKUMO": "Combina el Ritmo",
        "descRinTSUKUMO": "Cada acción que realiza otorga una nota, y una combinación de notas especificas permite usar ataques especiales.",
        "titleKurikoTSUKUMO": "Siente el Ritmo",
        "descKurikoTSUKUMO": "El tema del juego consiste en una combinación de la era futurista-neón y chicas rebeldes listas para combatir contra cualquiera que se atreva a desafiarlas.",

        "titleBURROUGHS": "BURROUGHS",
        "miniSummaryBURROUGHS": "WebRPC Player",
        "SummaryBURROUGHS": "WebRPC Player",
        "detailsBURROUGHS": "Work-in-progress RPC player created using React, Node.js, and MongoDB, which allows users to host a lobby where others can join. \n This hosted lobby facilitates communication between users and enables synchronized music playback from YouTube, Spotify, and SoundCloud, thanks to a public open-sourced reversed-engineered API.",
        
        "titleREMU": "Natsuki Remu",
        "miniSummaryREMU": "Discord Bot",
        "summaryREMU": "Discord Bot de Música",
        "detailsREMU": "Discord bot creado utilizando Discord.py y Lavaplayer API, lo que permite a los usuarios ejecutar comandos externos dentro de un servidor de Discord. \nEste bot funciona para escuchar música que permite a los usuarios escuchar música interrumpida de plataformas como YouTube, Spotify y SoundCloud.\nAdemás, el bot integra un large language model preentrenado con un servidor Ollama que esta localmente en un Raspberry Pi.",

        "titlePlayREMU": "Escucha la Música",
        "descPlayREMU": "Escucha cualquier música que desees, desde YouTube hasta de Spotify, en la comodidad de tu servidor de Discord.",
        "titleSkipREMU": "Skip la Música",
        "descSkipREMU": "Cualquier música que no quieras escuchar se puede skip con un solo comando.",
        "titleQueueREMU": "Ve la Lista Larga de Música",
        "descQueueREMU": "Con las capacidades de este bot, escuchar lista de música enormes y/o álbumes grandes es fácil.",
        "titleShuffleREMU": "Mezcla la Lista de Música",
        "descShuffleREMU": "Aleatoriza tu lista de reproducción cargada para añadir un poco de variedad.",

        "titlePORTFOLIO": "Portafolio",
        "miniSummaryPORTFOLIO": "React Web",
        "summaryPORTFOLIO": "Pagina Web React",
        "detailsPORTFOLIO": "Portafolio creado enteramente usando React, TypeScript y Tailwind CSS, que sirve como una ventana para una selección de proyectos que he creado y trabajado con pasión, marcando una época significativa en mi trayectoria de desarrollo. \n Cada proyecto presentado refleja mis habilidades y creatividad, demostrando un compromiso con la calidad y la usabilidad. \n Gracias por tomarte el tiempo de explorar mi portafolio. Aprecio mucho el interés en mi trabajo, ya que estoy apasionado por compartir mis habilidades y proyectos. \n ¡MUCHAS GRACIAS!",

        "demo": "Probar demo",
        "demoError": "Demo no disponible",

        "error": "La página que estas buscando no existe. Por favor verifique el URL o váyase para la página hogar."
    
    },

    "ja": {
        "spanish": "スペイン語",
        "english": "英語",
        "japanese": "日本語",

        "home": "ホーム",
        "projects": "プロジェクト",
        "contacts":"連絡",

        "greetings": "いらっしゃいませ！",
        "intro": "僕のフルネームは <fn> <ln1> <ln2> \n <pn>と呼んでいただいてもいいです",

        "aboutHeader": "僕のこと",
        "about": "プエルトリコ・バヤモン大学の大学院生であり、UI/UXデザイン、ゲーム開発、ウェブ開発において約<years>年の経験を持つ専念したソフトウェアエンジニアです。\nゲームジャムのために、さまざまなエンジン、ツール、技術を使用してゲームを開発するビデオゲーム研究チームに積極的に参加しました、さらに、いくつかの情熱プロジェクトに取り組み、ソフトウェア開発プロセスにおける貴重な洞察と実践的な経験を得ることができました。\nこれにより、僕の継続的な学習とスキル向上へのコミットメントを示し、余暇の時間を活用して成長の機会を最大限に活かすよう努めています。",

        "skills": "スキル一覧",
        "skillsLang": "プログラミング言語",
        "skillsTools": "ツール",
        "skillsGame": "ゲーム",
        "skillsWeb": "ウェブ",
                
        "projectList": "プロジェクト一覧",

        "viewPage": "ページを見る",

        "demoHeader": "デモ",
        "videoHeader": "ビデオ",
        "linksHeader": "リンク",

        "resume": "レジュメ",
        "email": "メール",
        "sourceCode": "ソースコード",

        "download": "ダウンロード",
        "website": "ウェブサイト",

        "titleBGMAPP": "ビージーエムアプリ",
        "miniSummaryBGMAPP": "音楽プレイヤー",
        "summaryBGMAPP": "背景音楽プレイヤー",
        "detailsBGMAPP": "ElectronとViteを使用して開発された音楽アプリケーションで、ローカルディレクトリとオンラインプラットフォームの両方から音楽トラックを再生することができます。\nこのアプリは、プレーヤーの状態を効果的に制御・管理するために戦略的に設計された直感的なユーザーインターフェースを備えています。\n仮想化やレイジーローディングなどの最適化により、シームレスなユーザー体験を提供し、アプリケーション全体でスムーズな操作とナビゲーションを可能にしています。",

        "titleViewBGMAPP": "音楽を気軽に聴く",
        "descViewBGMAPP": "フォーマットやソースに関わらず、あらゆるトラックを再生できるよう設計されたオーディオプレーヤーにより、ユーザーは音楽を楽しむことができます。",
        "titleActionBGMAPP": "基本的な機能を保持",
        "descActionBGMAPP": "典型的なトラックプレーヤーの基本機能で、再発明する必要もなく、不要な変更を強いることがありません。",
        "titleSearchBGMAPP": "大きなライブラリ？問題なし",
        "descSearchBGMAPP": "大量のトラックを考慮して基本的に設計されており、レイジーローディングと仮想化のおかげで広範なライブラリに最適化されています。",
        "titleLightThemeBGMAPP": "必須ユーティリティ",
        "descLightThemeBGMAPP": "ライトテーマとダークテーマの変更、言語選択、オンライントラックのダウンロード、ホームディレクトリの選択など、ユーザーエクスペリエンスを向上させる必須ユーティリティを標準搭載しています。",
        "titleResponsiveBGMAPP": "記憶に残らないUI",
        "descResponsiveBGMAPP": "ユーザーの干渉を最小限に抑え、インタラクションを簡素化するために統合されたさまざまなUI技術。",

        "titleL2DWP": "Live2Dウォールペーパー",
        "miniSummaryL2DWP": "ライブ壁紙",
        "summaryL2DWP": "インタラクティブLive2Dウォールペーパー",
        "detailsL2DWP": "UnityとAndroid Studioを使用して開発されたインタラクティブなLive2D壁紙で、ユーザーがキャラクターをクリックすることで、さまざまな感情やボイスラインを引き出すことができます。\nこのゲームはライブ壁紙として機能し、ジェスチャーやタッチ動作を通じてキャラクターと対話することができ、さまざまな感情や機能を引き出します。\n主にAndroid向けに設計されており、Androidの機能とのネイティブなインタラクションを可能にします。また、PCやWebGLプラットフォームにも対応しており、アクセス性を広げています。",

        "titleCharacterIdleL2DWP": "つながりを保つ",
        "descCharacterIdleL2DWP": "Androidの壁紙としての統合を可能にし、完全にカスタマイズされたライブ壁紙を楽しむことができます。",
        "titleCharacterTalkL2DWP": "インタラクションが体験を向上させる",
        "descCharacterTalkL2DWP": "Live2Dキャラクターとインタラクトすることで、動きやボイスラインを含むさまざまな楽しいインタラクションが可能です。",
        "titleCharacterUIL2DWP": "機能のための統合UI",
        "descCharacterUIL2DWP": "Android Studioのプラグインのおかげで、Androidの設定を構成するためのUIが装備されています。",
        "titleNextCharacterTalkL2DWP": "パーソナライズされた体験",
        "descNextCharacterTalkL2DWP": "Live2D Cubismをサポートする任意のキャラクターを壁紙に簡単に統合し、真に個人的な体験を作り出します。",

        "titleSYMBIOMATA": "シンビオマタ",
        "miniSummarySYMBIOMATA": "協力プレイVRゲーム",
        "summarySYMBIOMATA": "非対称協力プレイVRゲーム",
        "detailsSYMBIOMATA": "Unityで作成された非対称VR協力プラットフォーマーで、VRプレイヤーが手の動作を担当し、PCプレイヤーがプラットフォームを担当します。\n ゲームはローカルおよびオンラインのゲームモードの両方を備えています。オンラインモードは、VRの手の動きに対するクライアント側の予測や弾道の遅延補償など、業界標準のプラクティスと機能を使用したサーバー権限のアーキテクチャで設計されています。また、マッチメイキングを容易にするためのリレーやロビーも備えています。\n 含まれている映像は、実際のオンラインゲームプレイから撮影されたものです。",

        "titleSlashSYMBIOMATA": "距離に関係なく現実を超越する",
        "descSlashSYMBIOMATA": "ローカルまたはオンラインでスリルを味わうことができます。同じ機械でローカルを組むか、インターネットを通じて世界中の誰かとつながることができます。",
        "title2DSYMBIOMATA": "勝利の鍵はチームワーク",
        "desc2DSYMBIOMATA": "成功は協力にかかっています。VRプレイヤーはPCプレイヤーの指導を頼りに危険を回避し、PCプレイヤーはVRプレイヤーに登ることや脅威からの保護を依存します。",
        "titleZiplineSYMBIOMATA": "ユニークなステージを一緒にナビゲート",
        "descZiplineSYMBIOMATA": "PCとVRの協力がシームレスに行えるように特別に設計された障害物が満載のさまざまなステージを通じて冒険できます。",
        "titleVRPovSYMBIOMATA": "異なる視点、共有された旅",
        "descVRPovSYMBIOMATA": "PCプレイヤーがキャラクターの動きを制御し、VRプレイヤーがXRコントローラーを使用して没入型の3D環境を正確に制御できるユニークなゲームプレイ体験できます。",

        "titleONIGIRI": "鬼切り",
        "miniSummaryONIGIRI": "ソウルライクゲーム",
        "summaryONIGIRI": "ソウルライクゲーム",
        "detailsONIGIRI": "Unityで開発されたソウルライクのシングルプレイヤーゲームで、プレイヤーは強力なボスと激しい戦闘を繰り広げます。\nゲームプレイは、正確なパリィに焦点を当てており、プレイヤーは敵の攻撃を反撃するためにパリィのタイミングを完璧に合わせる必要があります。\nパリィと回避のタイミングをマスターすることは生存に不可欠であり、戦闘の流れを変えるためには素早い反応が求められます。\n各遭遇はスキルと戦略を要求し、プレイヤーは回避と反撃のバランスを取ることに挑戦されます。",

        "titleBossONIGIRI": "強力な敵に対して反撃する",
        "descBossONIGIRI": "敵のAIは、状況に基づいた本能的な意思決定を用いて、ゲーム全体の挑戦と没入感を高めるように設計されています。",
        "titleBossEntranceONIGIRI": "冒険に出かけよう",
        "descBossEntranceONIGIRI": "悪魔が徘徊するファンタジーの封建日本の豊かな詳細で作られた世界。",
        "titleBossParryONIGIRI": "恐ろしい障害を克服する",
        "descBossParryONIGIRI": "コアメカニクスは、定義されたタイミングウィンドウ内で敵の攻撃に対して正確なパリィを実行することを強調し、効果的な反撃と敵への報復を可能にします。",
        "titleMageONIGIRI": "攻撃を躱しながら勝利を収める",
        "descMageONIGIRI": "成功は、回避メカニクスの賢い使用にも依存しており、正確な使用が勝利を達成するために重要です。",
        "titleUnblockableONIGIRI": "戦いのリズムに乗る",
        "descUnblockableONIGIRI": "敵は独自の攻撃パターンを示し、効果的に克服するためには適応的で思慮深く戦略的なアプローチが必要です。",

        "titleNEKOMATA": "ネコマタ",
        "miniSummaryNEKOMATA": "弾幕シューティング",
        "summaryNEKOMATA": "弾幕シューティング",
        "detailsNEKOMATA": "Unreal Engine 5で開発されたボスラッシュの弾幕シューティングゲームで、東方シリーズからインスパイアを受けています。\nプレイヤーは、一連の挑戦的なボスと対峙し、それぞれがユニークなパターンと避けられない弾を持っており、コアのリワインドメカニクスを戦略的に使用することを促します。\nこのリワインド能力により、前の位置に戻ることで攻撃を回避でき、高リスクな環境を生み出し、すべての動きと決定が重要になります。\n高リスク・高リターンのゲームプレイに焦点を当て、複雑な弾幕パターンをナビゲートするためには、反射神経とタイミングをマスターすることが求められます。",

        "titleTutorialNEKOMATA": "プロトコル・リワインド",
        "descTutorialNEKOMATA": "ゲームのコアメカニクスで、リワインドを使用することで以前の位置に戻りながら無敵になることができ、その利点を最大限に活かすために戦略的な使用が促されます。",
        "titleBossFightNEKOMATA": "挑戦的な敵",
        "descBossFightNEKOMATA": "各ボスは独自の弾幕パターンを持ち、ステージが進むにつれて複数のフェーズがあり、より挑戦的で魅力的になります。",
        "titleMinionFightNEKOMATA": "没入型の同期音楽",
        "descMinionFightNEKOMATA": "さまざまなシナリオを音楽と同期させるために構築された広範なオーディオシステムにより、完全に没入できるゲームプレイです。",
        "titlePlagueRatBossNEKOMATA": "挑戦的なゲームプレイ",
        "descPlagueRatBossNEKOMATA": "プレイヤーは知識とスキルを駆使して強力な敵を克服するための知恵比べに挑む、挑戦的なゲームプレイです。",

        "titleTSUKUMO": "付喪神テンポ",
        "miniSummaryTSUKUMO": "リズムゲーム",
        "summaryTSUKUMO": "リズムアクションゲーム",
        "detailsTSUKUMO": "リズムアクションゲームで、Unreal Engine 5で開発されています。プレイヤーは脈打つ音楽のビートに合わせて行動を同期させる必要があります。\nゲームプレイでは、ユニークなカセットテープのメカニクスが導入されており、各アクションはカセットのテープを消耗させたり補充したりします。これにより、リズム体験に戦略的な要素が加わります。\nリスクとリワードの評価が重要であり、カセットテープの管理が成功の鍵となります。音楽は行われたアクションと同期し、ダイナミックなアクション体験できます。",

        "titleAmanoTSUKUMO": "リズムフロー",
        "descAmanoTSUKUMO": "すべてのアニメーションとアクションはリズムに密接に結びついており、音楽とゲームプレイがシームレスに融合し、ダイナミックなオーディオビジュアルアクション体験に没入させています。",
        "titleRinTSUKUMO": "リズムを組み合わせる",
        "descRinTSUKUMO": "プレイヤーが行う各アクションはノートを与え、ノートの組み合わせによって特別な攻撃を使用する能力が得られます。",
        "titleKurikoTSUKUMO": "リズムを感じる",
        "descKurikoTSUKUMO": "ゲームのテーマは、未来的なネオン時代と、誰にでも立ち向かう準備ができたスケバンたちの組み合わせで構成されています。",

        "titleBURROUGHS": "BURROUGHS",
        "miniSummaryBURROUGHS": "WebRPC Player",
        "SummaryBURROUGHS": "WebRPC Player",
        "detailsBURROUGHS": "Work-in-progress RPC player created using React, Node.js, and MongoDB, which allows users to host a lobby where others can join. \n This hosted lobby facilitates communication between users and enables synchronized music playback from YouTube, Spotify, and SoundCloud, thanks to a public open-sourced reversed-engineered API.",
        
        "titleREMU": "ナツキ・レム",
        "miniSummaryREMU": "Discord Bot",
        "summaryREMU": "音楽Discord Bot",
        "detailsREMU": "Discord Bot、Discord.pyとLavaplayer APIを使用して構築されており、ユーザーがDiscordサーバー内で外部コマンドを実行できるようにしています。\nこのボットは音楽プレーヤーとして機能し、ユーザーがYouTube、Spotify、SoundCloudなどのプラットフォームから途切れることなく音楽を聴くことができます。\nさらに、このボットは、ローカルでホストされたRaspberry PiのOllamaサーバーと統合されたトレーニング済みの大規模言語モデルを組み込んでおります。",

        "titlePlayREMU": "音楽を聴こう",
        "descPlayREMU": "YouTubeからSpotifyまで、好きな音楽をDiscordサーバーの快適な環境で再生して聴くことができます。",
        "titleSkipREMU": "音楽をスキップ",
        "descSkipREMU": "聴きたくない音楽は、1つのコマンドで簡単にスキップできます。",
        "titleQueueREMU": "音楽プレイリストを見る",
        "descQueueREMU": "このボットの機能を使えば、大きな音楽リストやアルバムを簡単に聴くことができます",
        "titleShuffleREMU": "音楽リストをシャッフル",
        "descShuffleREMU": "読み込んだプレイリストをランダムにできます。",

        "titlePORTFOLIO": "ポートフォリオ",
        "miniSummaryPORTFOLIO": "React ウェブサイト",
        "summaryPORTFOLIO": "React ウェブサイト",
        "detailsPORTFOLIO": "React、Typescript、Tailwind CSSを使用して制作されたポートフォリオウェブサイトは、僕が情熱を持って制作に取り組んだプロジェクトの数々を紹介するショーケースの役割を果たし、僕の開発人生の重要なマイルストーンとなりました。\n 各プロジェクトは、僕のスキルと創造性を反映し、品質とユーザビリティへのコミットメントを示しています。\n 僕のポートフォリオをご覧いただき、ありがとうございます。僕のスキルやプロジェクトを分かち合いたいので、僕の作品に関心を持っていただき、とても感謝しています。\n 本当にありがとうございました！",

        "demo": "体験デモ",
        "demoError": "デモ不利用",

        "error": "探しているページが存在しません。また、「URL」にエラーがあるかも。再度確認していただくか、ホームページに戻るか。"
    }
}