{
    "en": {
        "spanish": "Spanish",
        "english": "English",
        "japanese": "Japanese",

        "home": "Home",
        "projects": "Projects",
        "contacts":"Contacts",

        "greetings": "Greetings!",
        "introName": "My name is ",
        "introPenname": "I also go by the pen name ",
        "endPenname": " ",
        
        "aboutHeader": "About Me",
        "aboutIntro": "I am a dedicated student currently enrolled at the University of Puerto Rico Bayamon, with a concentration in Computer Science.",
        "aboutExp1": "With a foundation established since high school, I have approximately",
        "aboutExp2": "years of experience in this field.",
        "aboutEnd": "I am committed to continuously learning and honing my skills in my spare time, as I am determined to learn as much as possible from every experience. Through engaging in a variety of passion projects, I have gained invaluable experience and insight on the development process of software development.",
 
        "skillsIntro": "Technical Skills",
        
        "projectListOld": "EXPLORE THE IMPRESSIVE PROJECTS THAT I WORKED ON",
        "projectList": "Awesome Projects",
        "errorList": "Available Projects",
        "summaryProjectList": "I made",

        "viewPage": "View Page",

        "demoHeader": "Demo",
        "videoHeader": "Preview",
        "linksHeader": "Links",
        
        "resume": "Resume",
        "email": "Email",
        "sourceCode": "Source Code",

        "titleBGMAPP": "Background Music Application",
        "miniSummaryBGMAPP": "Track Player",
        "summaryBGMAPP": "Desktop Track Player",
        "detailsBGMAPP1": "Track player made using Electron and Vite, offers the functionality to play music tracks sourced from either a local directory containing downloaded tracks or directly from online sources.",
        "detailsBGMAPP2": "The track player is thoughtfully crafted with an intuitive user interface that has been strategically placed to effectively control and manage the player's state. These design elements contribute to a seamless user experience, allowing for effortless control and smooth navigation throughout the application.",
        "detailsBGMAPP3": "",

        "extraDetailsBGMAPP1": "Robust Track Player application built using Electron and Vite, designed to provide users with versatile music playback experience. It allows users to play music tracks from two primary sources: a local directory filled with downloaded tracks and online source.",
        "extraDetailsBGMAPP2": "The player features a thoughtfully designed user interface that prioritizes ease of use. Key controls for play, pause, skip, and volume adjustment are intuitively positioned, ensuring that users can manage their listening experience with minimal effort. The layout is clean and responsive, enhancing navigation and making it easy for users to browse through their music library or search for tracks online.",
        "extraDetailsBGMAPP3": "Overall, the Track Player combines functionality with a user-friendly design, making it an ideal choice for a seamless way to enjoy favorite music tracks.",
        "extraDetailsBGMAPP4": " ",

        "titleViewBGMAPP": "Listen to music without distractions",
        "descViewBGMAPP": "BGMAPP allows the use of local music tracks by allowing the user to insert their own music track via any format the music track comes in.",
        "titleShuffleBGMAPP": "Never listen to the same old music again",
        "descShuffleBGMAPP": "BGMAPP is not whole without a shuffle functionally, which brings the essential of a music player to the application to randomize the music tracks.",
        "titleInputSearchBGMAPP": "Big library? No problem",
        "descInputSearchBGMAPP": "BGMAPP comes equipped with the functionality to search for any music track whenever the user wants to listen to their favorite tracks.",
        "titleContextMenuBGMAPP": "Play music at your own pace",
        "descContextMenuBGMAPP": "BGMAPP uses a context menu that allows the user to queue music track whichever way they prefer.",

        "titleL2DWP": "Live 2D Wallpaper",
        "miniSummaryL2DWP": "Live Wallpaper",
        "summaryL2DWP": "Interactive Live 2D Wallpaper",
        "detailsL2DWP1": "Interactable Live2D wallpaper made in Unity and Android Studio, which can contain various Live2D characters to interact with.",
        "detailsL2DWP2": "The game functions as a wallpaper that allow users to interact with these characters by clicking on them, triggering various emotions and voice lines. While primarily designed for use as an Android wallpaper, it is also compatible with desktops and WebGL platforms. Additionally, the Android version supports plugins that enable the utilization of native Android functions.",
        "detailsL2DWP3": "All footage included on this page was taken from the desktop build.",

        "extraDetailsL2DWP1": "Interactable Live2D Wallpaper application developed using Unity and Android Studio, designed to transform static backgrounds into dynamic, engaging experiences. This game disguised as a wallpaper features the ability to interact with a Live2D character directly on their devices on the homepage.",
        "extraDetailsL2DWP2": "The interactive nature of the wallpaper allows users to click on these characters, triggering a range of responses that include animated emotional expressions and corresponding voice lines. This feature not only enhances the visual appeal of the normal boring wallpaper but also creates a more personalized user experience.",
        "extraDetailsL2DWP3": "While the primary focus of the Interactable Live2D Wallpaper is to serve as a lively backdrop for Android devices, it is also designed to be compatible with desktop environments and WebGL platforms. This cross-platform functionality ensures that users can enjoy the interactive wallpaper on a variety of devices, maintaining a consistent experience regardless of the platform.",
        "extraDetailsL2DWP4": " ",

        "titleCharacterIdleL2DWP": "Don’t ever feel alone",
        "descCharacterIdleL2DWP": "Can be integrated as an Android wallpaper that can be used as a customized live wallpaper.",
        "titleCharacterTalkL2DWP": "Interaction is key",
        "descCharacterTalkL2DWP": "Interacting with the Live2D character will activate various interactions such as movement and voice lines.",
        "titleCharacterUIL2DWP": "Minimalist UI functionality",
        "descCharacterUIL2DWP": "L2DWP contains UI functionality that can be configured to interact with the android classes using Android Studio in Unity.",
        "titleNextCharacterTalkL2DWP": "Personalize your experience",
        "descNextCharacterTalkL2DWP": "With the L2DWP any character that supports Live2D can be inserted into the wallpaper.",

        "titlePCVR": "Project Coop Virtual Reality",
        "miniSummaryPCVR": "VR Coop Game",
        "summaryPCVR": "Asymmetrical VR Coop Game",
        "detailsPCVR1": "An asymmetrical VR coop platformer made in Unity, where the VR player is in charge of hand actions and the PC player is in charge of platforming.",
        "detailsPCVR2": "The game features both local and online game modes. The latter of which is designed with a server-authoritative architecture using standard industry practices and features, such as client-side prediction for VR hand movement and projectile lag compensation, along with relay and lobbies for easy matchmaking.",
        "detailsPCVR3": "All footage included on this page was taken from real online gameplay.",

        "extraDetailsPCVR1": "The asymmetrical VR co-op platformer is a gaming experience developed in Unity, designed to foster collaboration between players using different platforms. In this video game, one player immerses themselves in a virtual reality (VR) environment, taking on the role of a UFO, while the other player engages from a PC setup, to control a broken robot. This unique setup creates a dynamic gameplay experience where each player has distinct responsibilities and gameplay mechanics.",
        "extraDetailsPCVR2": "The VR player is tasked with executing hand actions, utilizing motion controls to interact with the environment, manipulate objects, and assist the PC player in navigating through various challenges. This player can perform actions such as grabbing, throwing, or activating switches, all of which are crucial for progressing through the game’s levels. ",
        "extraDetailsPCVR3": "On the other hand, the PC player focuses on platforming elements, controlling a character that must jump, run, and navigate through intricate levels filled with obstacles. This player relies on keyboard and mouse controls, requiring precise timing and coordination to overcome challenges. The synergy between the two players is essential, as the VR player’s actions can directly impact the PC player’s ability to progress, and vice versa, creating a cooperative gameplay dynamic that emphasizes teamwork and communication.",
        "extraDetailsPCVR4": "The game supports both local and online multiplayer modes, allowing players to team up in the same physical space or connect remotely. The online mode is built with a server-authoritative architecture, ensuring a stable and fair gaming experience. This architecture employs standard industry practices, such as client-side prediction for VR hand movements, which minimizes latency and enhances the responsiveness of the VR player’s actions. Additionally, projectile lag compensation is implemented to ensure that any projectiles fired by the VR player behave accurately, regardless of network delays.",

        "titleSlashPCVR": "Transcend realities regardless of your physical distance",
        "descSlashPCVR": "PCVR can be played locally or online, giving you the ability to choose to play with someone on the same machine or with someone far away over the internet.",
        "title2DPCVR": "Coordination is the key to success",
        "desc2DPCVR": "Without the PC player, the VR player cannot avoid danger and without the VR player, the PC player cannot be protected from danger.",
        "titleZiplinePCVR": "Find your way across various different stages",
        "descZiplinePCVR": "PCVR contains various stages with obstacles especially designed for PC and VR cooperation.",
        "titleVRPovPCVR": "Different perspectives, shared body",
        "descVRPovPCVR": "PCVR combines the ability to platform by allowing the PC player to control the movement of the character, and enabling the VR player to have full precision control over the virtual 3D space with the XR controllers.",

        "titleONIGIRI": "Slasher Demon",
        "miniSummaryONIGIRI": "Souls-like Game",
        "summaryONIGIRI": "Unity 3D Souls-like Game",
        "detailsONIGIRI1": "A Souls-like singleplayer game made in Unity, where the player must defeat enemies by parrying and dodging.",
        "detailsONIGIRI2": "The game features the ability to roll and parry, which is essential to the core gameplay of the game. To be available to attack, the player must parry the incoming attack of the enemy if it’s a close-range attack, else the player must dodge the projectile if it’s a long-range attack which if dodged at the correct timing the player is rewarded.",
        "detailsONIGIRI3": "All footage included on this page was taken from real gameplay.",

        "extraDetailsONIGIRI1": "Souls-like single-player game, developed in Unity, immerses players in a challenging and atmospheric world where combat and strategic timing are paramount. Drawing inspiration from the renowned Souls series, the game emphasizes a methodical approach to combat, requiring players to parry and dodge to overcome formidable enemies.",
        "extraDetailsONIGIRI2": "At the heart of the gameplay mechanics is the parry and dodge system, which serves as the foundation for the combat encounters. Close-range attacks from enemies can be countered through precise parrying timing. When timed perfectly, a parry not only negates the incoming damage but also creates an opening for the player to launch a counterattack, rewarding skillful play with opportunities for aggressive retaliation.",
        "extraDetailsONIGIRI3": "For long-range attacks, players must rely on their dodging abilities. The game features a fluid rolling mechanic that allows players to evade projectiles. Timing is crucial; if players successfully dodge an incoming projectile at the right moment, they are rewarded with a brief window of invulnerability, allowing them to reposition themselves or prepare for a counterattack. This rewarding timing mechanic encourages players to develop a keen sense of rhythm and anticipation, enhancing the overall combat experience.",
        "extraDetailsONIGIRI4": " ",

        "titleBossONIGIRI": "Defeat the almighty Gashadokuro",
        "descBossONIGIRI": "The attack pattern of the final boss, Gashadokuro’s AI, was designed to enhance the overall challenge and engagement of the game. Depending on if the player is either at long range or close range it will try to outmaneuver the player.",
        "titleBossEntranceONIGIRI": "Explore a fantasy world in one of the mountains of Japan with an eye-catching environment",
        "descBossEntranceONIGIRI": "Onigiri’s world is crafted with the goal to display as much detail as possible to display a fantasy feudal Japan.",
        "titleBossParryONIGIRI": "Let nothing stand in your way",
        "descBossParryONIGIRI": "Onigiri's combat mechanics revolve around executing precise parries of the enemy's attacks within a specific frame window to counter-hit the opponent to inflict damage.",
        "titleMageONIGIRI": "Dodge your way out of trouble",
        "descMageONIGIRI": "If a projectile is dodged at the correct time, the player will be rewarded, but if missed the player will get hit and lose hit points. Dodging was implemented for high-risk high-reward situations.",
        "titleUnblockableONIGIRI": "Waiting is the demon’s trump card",
        "descUnblockableONIGIRI": "Onigiri contains enemies with distinct attack patterns, necessitating a thoughtful and calculated approach from the player to overcome the obstacles.",

        "titleBURROUGHS": "BURROUGHS",
        "miniSummaryBURROUGHS": "WebRTC Player",
        "SummaryBURROUGHS": "Unity 3D Game",
        "detailsBURROUGHS1": "b1lah blah blah",
        "detailsBURROUGHS2": "blah blah blah",
        "detailsBURROUGHS3": "blah blah blah",

        "titleNEKOMATA": "P.U.R.R (Programmable Unit for Rewinding Reality)",
        "miniSummaryNEKOMATA": "BulletHell Game",
        "summaryNEKOMATA": "Bullet Hell Game",
        "detailsNEKOMATA1": "A boss rush single-player bullet hell game made in Unreal Engine 5, taking inspiration from the Touhou series, the player must destroy enemies by shooting while simultaneously dodging the enemy projectiles.",
        "detailsNEKOMATA2": "The game focuses on a rewind ability that enables the player to dodge projectiles that are normally not avoidable. However, activating the rewind will turn all active enemy projectiles into a stronger variant depending on the boss.",
        "detailsNEKOMATA3": "All footage included on this page was taken from real gameplay.",

        "extraDetailsNEKOMATA1": "Boss rush single-player bullet hell game, developed in Unreal Engine 5, draws inspiration from the iconic Touhou series, known for its intricate patterns and fast-paced gameplay. Players are thrust into a world filled with formidable space-rats bosses, each presenting unique challenges and requiring quick reflexes and strategic thinking to overcome.",
        "extraDetailsNEKOMATA2": "The game forces the player to make skillful and quick decision-making when dodging projectiles, as the player has the ability to rewind back to a previous position, although not without a consequence depending on the boss. The consequence is part of the core gameplay as rewinding will turn every enemy projectile that is present on the screen into a more powerful variant of itself. The gameplay is designed to be exhilarating, with a focus on precision and timing.",
        "extraDetailsNEKOMATA3": "Since the game is a boss rush, it features a roster of various bosses, each designed with intricate visual aesthetics and unique attack patterns that challenge players in different ways. The art style is vibrant and dynamic, with beautifully composed music that enhances the immersive experience.",
        "extraDetailsNEKOMATA4": " ",

        "titleTutorialNEKOMATA": "New or Old",
        "descTutorialNEKOMATA": "Nekomata features a simple basic tutorial that can teach players how to use the rewind ability and even teach the most basic techniques of classic games like Touhou.",
        "titleBossFightNEKOMATA": "Precise movement and good decision making",
        "descBossFightNEKOMATA": "The gameplay of Nekomata challenges the player into a battle of wits that with sufficient knowledge and skill, the player will be rewarded.",
        "titleMinionFightNEKOMATA": "Synchronized mice ballets form a destructive force",
        "descMinionFightNEKOMATA": "Using a very extensive and detailed audio system, the AI of the enemies are synched with the music for a full immersive gameplay effect.",
        "titlePlagueRatBossNEKOMATA": "Quick thinking or Death",
        "descPlagueRatBossNEKOMATA": "In Nekomata the player has to think fast to react or be destroyed in a barrage of non-stopping bullets.",
        
        "titlePORTFOLIO": "PORTFOLIO",
        "miniSummaryPORTFOLIO": "React Website",
        "summaryPORTFOLIO": "React Website",
        "detailsPORTFOLIO1": "Portfolio website created entirely using React, Typescript, and Tailwind CSS. The site serves as a showcase of various projects that I have passionately developed, presenting a significant milestone in my journey as a developer. I selected these projects to highlight my skills and creativity, ensuring that they are polished and ready for presentation.",
        "detailsPORTFOLIO2": "Using the principles of UI theory, every UI elements is thoughtfully placed to ensure the most minimum information required to be understandable and a layout that not only is pleasing but also enhances usability. No spectrum leaves untouched as the core of the portfolio are the projects, which every project specifically highlights their functionality, design, and objective. ",
        "detailsPORTFOLIO3": "Thank you very much for taking the time to explore my portfolio. Your interest in my work means a great deal to me, as I am excited to share my skills and projects.",

        "demoAvailable": "Try Demo",
        "demoError": "No Demo Available",

        "error": "The page you are looking for does not seem to exist. Please check the URL or navigate to the homepage."
        
    },

    "es": {
        "spanish": "Español",
        "english": "Inglés",
        "japanese": "Japonés",

        "aboutHeader": "Sobre mí",


        "titleBGM": "BGM-App (Aplicación de Música)",


        "resume": "Resume",
        "email": "Correo Electrónico"
    },

    "ja": {
        "spanish": "スペイン語",
        "english": "英語",
        "japanese": "日本語",

        "home": "ホーム",
        "projects": "プロジェクト",
        "contacts":"連絡",

        "greetings": "ようこそいらっしゃいませ！",
        "introName": "僕のフルネームは",
        "introPenname": " ",
        "endPenname": "と呼んでいただいてもいいです",

        "aboutHeader": "僕のこと",
        "aboutIntro": "",
        "aboutExp1": "",
        "aboutExp2": "",
        "aboutEnd": "",

        "skillsIntro": "スキル一覧",
                
        "projectList": "プロジェクト一覧",
        "summaryProjectList": "　",

        "viewPage": "ページを見る",

        "demoHeader": "デモ",
        "videoHeader": "Preview",
        "linksHeader": "リンク",

        "resume": "履歴書",
        "email": "メール",
        "sourceCode": "ソースコード",

        "download": "ダウンロード",
        "website": "ウェブサイト",

        "titleBGMAPP": "Background Music Application",
        "miniSummaryBGMAPP": "音楽プレイヤー",
        "summaryBGMAPP": "Desktop Track Player",
        "detailsBGMAPP1": "Track player made using Electron and Vite, offers the functionality to play music tracks sourced from either a local directory containing downloaded tracks or directly from online sources.",
        "detailsBGMAPP2": "The track player is thoughtfully crafted with an intuitive user interface that has been strategically placed to effectively control and manage the player's state. These design elements contribute to a seamless user experience, allowing for effortless control and smooth navigation throughout the application.",
        "detailsBGMAPP3": "",

        "extraDetailsBGMAPP1": "Robust Track Player application built using Electron and Vite, designed to provide users with versatile music playback experience. It allows users to play music tracks from two primary sources: a local directory filled with downloaded tracks and online source.",
        "extraDetailsBGMAPP2": "The player features a thoughtfully designed user interface that prioritizes ease of use. Key controls for play, pause, skip, and volume adjustment are intuitively positioned, ensuring that users can manage their listening experience with minimal effort. The layout is clean and responsive, enhancing navigation and making it easy for users to browse through their music library or search for tracks online.",
        "extraDetailsBGMAPP3": "Overall, the Track Player combines functionality with a user-friendly design, making it an ideal choice for a seamless way to enjoy favorite music tracks.",
        "extraDetailsBGMAPP4": " ",

        "titleViewBGMAPP": "Listen to music without distractions",
        "descViewBGMAPP": "BGMAPP allows the use of local music tracks by allowing the user to insert their own music track via any format the music track comes in.",
        "titleShuffleBGMAPP": "Never listen to the same old music again",
        "descShuffleBGMAPP": "BGMAPP is not whole without a shuffle functionally, which brings the essential of a music player to the application to randomize the music tracks.",
        "titleInputSearchBGMAPP": "Big library? No problem",
        "descInputSearchBGMAPP": "BGMAPP comes equipped with the functionality to search for any music track whenever the user wants to listen to their favorite tracks.",
        "titleContextMenuBGMAPP": "Play music at your own pace",
        "descContextMenuBGMAPP": "BGMAPP uses a context menu that allows the user to queue music track whichever way they prefer.",

        "titleL2DWP": "Live 2D Wallpaper",
        "miniSummaryL2DWP": "Live Wallpaper",
        "summaryL2DWP": "Interactive Live 2D Wallpaper",
        "detailsL2DWP1": "Interactable Live2D wallpaper made in Unity and Android Studio, which can contain various Live2D characters to interact with.",
        "detailsL2DWP2": "The game functions as a wallpaper that allow users to interact with these characters by clicking on them, triggering various emotions and voice lines. While primarily designed for use as an Android wallpaper, it is also compatible with desktops and WebGL platforms. Additionally, the Android version supports plugins that enable the utilization of native Android functions.",
        "detailsL2DWP3": "All footage included on this page was taken from the desktop build.",

        "extraDetailsL2DWP1": "Interactable Live2D Wallpaper application developed using Unity and Android Studio, designed to transform static backgrounds into dynamic, engaging experiences. This game disguised as a wallpaper features the ability to interact with a Live2D character directly on their devices on the homepage.",
        "extraDetailsL2DWP2": "The interactive nature of the wallpaper allows users to click on these characters, triggering a range of responses that include animated emotional expressions and corresponding voice lines. This feature not only enhances the visual appeal of the normal boring wallpaper but also creates a more personalized user experience.",
        "extraDetailsL2DWP3": "While the primary focus of the Interactable Live2D Wallpaper is to serve as a lively backdrop for Android devices, it is also designed to be compatible with desktop environments and WebGL platforms. This cross-platform functionality ensures that users can enjoy the interactive wallpaper on a variety of devices, maintaining a consistent experience regardless of the platform.",
        "extraDetailsL2DWP4": " ",

        "titleCharacterIdleL2DWP": "Don’t ever feel alone",
        "descCharacterIdleL2DWP": "Can be integrated as an Android wallpaper that can be used as a customized live wallpaper.",
        "titleCharacterTalkL2DWP": "Interaction is key",
        "descCharacterTalkL2DWP": "Interacting with the Live2D character will activate various interactions such as movement and voice lines.",
        "titleCharacterUIL2DWP": "Minimalist UI functionality",
        "descCharacterUIL2DWP": "L2DWP contains UI functionality that can be configured to interact with the android classes using Android Studio in Unity.",
        "titleNextCharacterTalkL2DWP": "Personalize your experience",
        "descNextCharacterTalkL2DWP": "With the L2DWP any character that supports Live2D can be inserted into the wallpaper.",

        "titlePCVR": "シンビオマタ",
        "miniSummaryPCVR": "協力プレイVRゲーム",
        "summaryPCVR": "Asymmetrical VR Coop Game",
        "detailsPCVR1": "An asymmetrical VR coop platformer made in Unity, where the VR player is in charge of hand actions and the PC player is in charge of platforming.",
        "detailsPCVR2": "The game features both local and online game modes. The latter of which is designed with a server-authoritative architecture using standard industry practices and features, such as client-side prediction for VR hand movement and projectile lag compensation, along with relay and lobbies for easy matchmaking.",
        "detailsPCVR3": "All footage included on this page was taken from real online gameplay.",

        "extraDetailsPCVR1": "The asymmetrical VR co-op platformer is a gaming experience developed in Unity, designed to foster collaboration between players using different platforms. In this video game, one player immerses themselves in a virtual reality (VR) environment, taking on the role of a UFO, while the other player engages from a PC setup, to control a broken robot. This unique setup creates a dynamic gameplay experience where each player has distinct responsibilities and gameplay mechanics.",
        "extraDetailsPCVR2": "The VR player is tasked with executing hand actions, utilizing motion controls to interact with the environment, manipulate objects, and assist the PC player in navigating through various challenges. This player can perform actions such as grabbing, throwing, or activating switches, all of which are crucial for progressing through the game’s levels. ",
        "extraDetailsPCVR3": "On the other hand, the PC player focuses on platforming elements, controlling a character that must jump, run, and navigate through intricate levels filled with obstacles. This player relies on keyboard and mouse controls, requiring precise timing and coordination to overcome challenges. The synergy between the two players is essential, as the VR player’s actions can directly impact the PC player’s ability to progress, and vice versa, creating a cooperative gameplay dynamic that emphasizes teamwork and communication.",
        "extraDetailsPCVR4": "The game supports both local and online multiplayer modes, allowing players to team up in the same physical space or connect remotely. The online mode is built with a server-authoritative architecture, ensuring a stable and fair gaming experience. This architecture employs standard industry practices, such as client-side prediction for VR hand movements, which minimizes latency and enhances the responsiveness of the VR player’s actions. Additionally, projectile lag compensation is implemented to ensure that any projectiles fired by the VR player behave accurately, regardless of network delays.",

        "titleSlashPCVR": "Transcend realities regardless of your physical distance",
        "descSlashPCVR": "PCVR can be played locally or online, giving you the ability to choose to play with someone on the same machine or with someone far away over the internet.",
        "title2DPCVR": "Coordination is the key to success",
        "desc2DPCVR": "Without the PC player, the VR player cannot avoid danger and without the VR player, the PC player cannot be protected from danger.",
        "titleZiplinePCVR": "Find your way across various different stages",
        "descZiplinePCVR": "PCVR contains various stages with obstacles especially designed for PC and VR cooperation.",
        "titleVRPovPCVR": "Different perspectives, shared body",
        "descVRPovPCVR": "PCVR combines the ability to platform by allowing the PC player to control the movement of the character, and enabling the VR player to have full precision control over the virtual 3D space with the XR controllers.",

        "titleONIGIRI": "オニギリ",
        "miniSummaryONIGIRI": "ソウルライクゲーム",
        "summaryONIGIRI": "Unity 3D Souls-like Game",
        "detailsONIGIRI1": "A Souls-like singleplayer game made in Unity, where the player must defeat enemies by parrying and dodging.",
        "detailsONIGIRI2": "The game features the ability to roll and parry, which is essential to the core gameplay of the game. To be available to attack, the player must parry the incoming attack of the enemy if it’s a close-range attack, else the player must dodge the projectile if it’s a long-range attack which if dodged at the correct timing the player is rewarded.",
        "detailsONIGIRI3": "All footage included on this page was taken from real gameplay.",

        "extraDetailsONIGIRI1": "Souls-like single-player game, developed in Unity, immerses players in a challenging and atmospheric world where combat and strategic timing are paramount. Drawing inspiration from the renowned Souls series, the game emphasizes a methodical approach to combat, requiring players to parry and dodge to overcome formidable enemies.",
        "extraDetailsONIGIRI2": "At the heart of the gameplay mechanics is the parry and dodge system, which serves as the foundation for the combat encounters. Close-range attacks from enemies can be countered through precise parrying timing. When timed perfectly, a parry not only negates the incoming damage but also creates an opening for the player to launch a counterattack, rewarding skillful play with opportunities for aggressive retaliation.",
        "extraDetailsONIGIRI3": "For long-range attacks, players must rely on their dodging abilities. The game features a fluid rolling mechanic that allows players to evade projectiles. Timing is crucial; if players successfully dodge an incoming projectile at the right moment, they are rewarded with a brief window of invulnerability, allowing them to reposition themselves or prepare for a counterattack. This rewarding timing mechanic encourages players to develop a keen sense of rhythm and anticipation, enhancing the overall combat experience.",
        "extraDetailsONIGIRI4": " ",

        "titleBossONIGIRI": "Defeat the almighty Gashadokuro",
        "descBossONIGIRI": "The attack pattern of the final boss, Gashadokuro’s AI, was designed to enhance the overall challenge and engagement of the game. Depending on if the player is either at long range or close range it will try to outmaneuver the player.",
        "titleBossEntranceONIGIRI": "Explore a fantasy world in one of the mountains of Japan with an eye-catching environment",
        "descBossEntranceONIGIRI": "Onigiri’s world is crafted with the goal to display as much detail as possible to display a fantasy feudal Japan.",
        "titleBossParryONIGIRI": "Let nothing stand in your way",
        "descBossParryONIGIRI": "Onigiri's combat mechanics revolve around executing precise parries of the enemy's attacks within a specific frame window to counter-hit the opponent to inflict damage.",
        "titleMageONIGIRI": "Dodge your way out of trouble",
        "descMageONIGIRI": "If a projectile is dodged at the correct time, the player will be rewarded, but if missed the player will get hit and lose hit points. Dodging was implemented for high-risk high-reward situations.",
        "titleUnblockableONIGIRI": "Waiting is the demon’s trump card",
        "descUnblockableONIGIRI": "Onigiri contains enemies with distinct attack patterns, necessitating a thoughtful and calculated approach from the player to overcome the obstacles.",

        "titleBURROUGHS": "BURROUGHS",
        "miniSummaryBURROUGHS": "WebRTC Player",
        "SummaryBURROUGHS": "Unity 3D Game",
        "detailsBURROUGHS1": "b1lah blah blah",
        "detailsBURROUGHS2": "blah blah blah",
        "detailsBURROUGHS3": "blah blah blah",

        "titleNEKOMATA": "ネコマタ",
        "miniSummaryNEKOMATA": "弾幕シューティング",
        "summaryNEKOMATA": "弾幕シューティング",
        "detailsNEKOMATA1": "A boss rush single-player bullet hell game made in Unreal Engine 5, taking inspiration from the Touhou series, the player must destroy enemies by shooting while simultaneously dodging the enemy projectiles.",
        "detailsNEKOMATA2": "The game focuses on a rewind ability that enables the player to dodge projectiles that are normally not avoidable. However, activating the rewind will turn all active enemy projectiles into a stronger variant depending on the boss.",
        "detailsNEKOMATA3": "All footage included on this page was taken from real gameplay.",

        "extraDetailsNEKOMATA1": "Boss rush single-player bullet hell game, developed in Unreal Engine 5, draws inspiration from the iconic Touhou series, known for its intricate patterns and fast-paced gameplay. Players are thrust into a world filled with formidable space-rats bosses, each presenting unique challenges and requiring quick reflexes and strategic thinking to overcome.",
        "extraDetailsNEKOMATA2": "The game forces the player to make skillful and quick decision-making when dodging projectiles, as the player has the ability to rewind back to a previous position, although not without a consequence depending on the boss. The consequence is part of the core gameplay as rewinding will turn every enemy projectile that is present on the screen into a more powerful variant of itself. The gameplay is designed to be exhilarating, with a focus on precision and timing.",
        "extraDetailsNEKOMATA3": "Since the game is a boss rush, it features a roster of various bosses, each designed with intricate visual aesthetics and unique attack patterns that challenge players in different ways. The art style is vibrant and dynamic, with beautifully composed music that enhances the immersive experience.",
        "extraDetailsNEKOMATA4": " ",

        "titleTutorialNEKOMATA": "New or Old",
        "descTutorialNEKOMATA": "Nekomata features a simple basic tutorial that can teach players how to use the rewind ability and even teach the most basic techniques of classic games like Touhou.",
        "titleBossFightNEKOMATA": "Precise movement and good decision making",
        "descBossFightNEKOMATA": "The gameplay of Nekomata challenges the player into a battle of wits that with sufficient knowledge and skill, the player will be rewarded.",
        "titleMinionFightNEKOMATA": "Synchronized mice ballets form a destructive force",
        "descMinionFightNEKOMATA": "Using a very extensive and detailed audio system, the AI of the enemies are synched with the music for a full immersive gameplay effect.",
        "titlePlagueRatBossNEKOMATA": "Quick thinking or Death",
        "descPlagueRatBossNEKOMATA": "In Nekomata the player has to think fast to react or be destroyed in a barrage of non-stopping bullets.",
        
        "titlePORTFOLIO": "PORTFOLIO",
        "miniSummaryPORTFOLIO": "React ウェブサイト",
        "summaryPORTFOLIO": "React ウェブサイト",
        "detailsPORTFOLIO1": "Portfolio website created entirely using React, Typescript, and Tailwind CSS. The site serves as a showcase of various projects that I have passionately developed, presenting a significant milestone in my journey as a developer. I selected these projects to highlight my skills and creativity, ensuring that they are polished and ready for presentation.",
        "detailsPORTFOLIO2": "Using the principles of UI theory, every UI elements is thoughtfully placed to ensure the most minimum information required to be understandable and a layout that not only is pleasing but also enhances usability. No spectrum leaves untouched as the core of the portfolio are the projects, which every project specifically highlights their functionality, design, and objective. ",
        "detailsPORTFOLIO3": "Thank you very much for taking the time to explore my portfolio. Your interest in my work means a great deal to me, as I am excited to share my skills and projects.",

        "demoAvailable": "デモを試する",
        "demoError": "No Demo Available",

        "error": "探しているページが存在しません。また、「URL」にエラーがあるかも。再度確認していただくか、ホームページに戻るか。"
    }
}