{
    "en": {
        "spanish": "Spanish",
        "english": "English",
        "japanese": "Japanese",

        "aboutHeader": "About Me -Patch",
        "aboutIntro1": "Hello and welcome to my AMAZING! portfolio. My name is Sebastian Rodriguez Medina, but I prefer to go by my pen name Patch. I am a student at the University of Puerto Rico Bayamon with about " ,
        "aboutIntro2": "years of experience in Computer Science, in which I began studying in high school. ",
        "aboutCenter": "I am committed to continuously learning and honing my skills in my spare time, as I am determined to learn as much as possible from every experience. I have worked on passion projects that have proved to be great sources of knowledge and insights on the development process on software development.",
        "aboutEnd": "Explore the projects I have worked on at the pace you desire. If you would like to contact me, feel free to do so ",
        "aboutHyperlink": "here",
        "aboutPoint": ".",

        "demo": "Click for Demo",
        "video": "Click for Preview",

        "tutorial": "Click on an image to examine the proyect!",
        
        "projectList": "Explore the impressive projects that I worked on ",
        
        "detailsHeader": "Project Description",
        
        "viewPage": "View Page",

        "titleBGM": "BGM-APP (Background Music Application)",
        "detailsBGM": "Local Music Track Player. Plays tracks from a directory that holds 2900+ downloaded tracks. The UI features intuitive buttons strategically designed to efficiently manage the state of the player, providing seamless control and ease of navigation.",
        
        "titleAwakeBGM": "Startup",
        "titleLayoutBGM": "Layout",
        "titleResults&QueueBGM": "Results in Current Queue",
        "titleNavbarBGM": "Navbar with buttons",
        "titleList&SearchBGM": "List with Input Search",
        "titleContextMenuBGM": "Context Menu",
        "descAwakeBGM": "When first starting the app, it will load all tracks and then the player will wait for a track url. To start the player there are various ways, to completely start a new queue then shuffling will load the first track of the queue. To load a queue, pressing the Load Queue button will instantly load the queue and then will find the first track that has not been played on the saved queue.",
        "descLayoutBGM": "The appearance of the app, on the left side it has the thumbnail, tracks in current queue, and the following 10 tracks. On the right it shows a table list of all the tracks in the directory, and an input search to search for tracks. Lastly, on the bottom there is a navbar to have complete control of the player.",
        "descResults&QueueBGM": "The app can display the thumbnail of the current playing, in the case that the track has no thumbnail then a template is shown. Below the thumbnail it will also display the number of available tracks in the current queue, with also showing the following 10 tracks of the queue.",
        "descNavbarBGM": "The navbar contains multiple buttons to control and manage the player. The buttons that are available from left to right are: Load Queue from a Json, Save Queue to a Json, find Duplicates, Shuffle, Previous Track, Pause/Play, Skip Track, Loop track, and Mute/Unmute with also containing a slider to adjust the volume.",
        "descList&SearchBGM": "A table list of the available tracks in the directory, the list from left to right contains: the index of the track, the title of the track, the duration of the track, and if it was played in the current queue. On top of the table list also contains an input search to search for tracks available in the directory, the table list will then scroll to the matching input.",
        "descContextMenuBGM": "The table list also contains a context menu which contains the following options: Stack (Stack the selected track on top of the current queue), Play (Instantly play the selected track), Clipboard (Copy to clipboard the title of the selected track) and Properties (Display current various properties of the selected track to the debug window).",

        "titleL2DWP": "L2DWP (Live 2D Wallpaper)",
        "detailsL2DWP": "Interactive Live 2D Character. Unity game with multiple Live2D characters that can be interacted with by clicking and triggers emotions and voice lines. Primarily aimed to be used as an android wallpaper but can also be used on desktops and WebGL. On the android version there are plugins that can be used to use native android functions.",

        "titleCharacterIdleL2DWP": "Character Idle",
        "titleCharacterTalkL2DWP": "Character Talking",
        "titleCharacterUIL2DWP": "UI on Long Press",
        "titleNextCharacterIdleL2DWP": "Second Character Idle",
        "titleNextCharacterTalkL2DWP": "Second Character Talk",
        "descCharacterIdleL2DWP": "The character being idle, if not pressing anything nor interacting with the character, the character will stand idly waiting for an interaction.",
        "descCharacterTalkL2DWP": "The character showing emotions, by clicking the screen the character will start a motion that will also trigger a voice line.",
        "descCharacterUIL2DWP": "A UI to change characters, by long pressing the screen a UI element will appear which can be clicked on either side to switch to a new character.",
        "descNextCharacterIdleL2DWP": "The other character being idle, like the previous character will also wait for an interaction.",
        "descNextCharacterTalkL2DWP": "Same idea as the previous character, by clicking the screen the character will trigger a motion and a voice line.",

        "titlePCVR": "PCVR (Project Computer Virtual Reality)",
        "detailsPCVR": "PC + VR Coop Video Game. Platformer video game where a player that owns a VR can play with another player that owns a PC. The PC player has control of the 3D plane by moving, jumping, and dashing, while the VR has complete control of climbing, shooting, slashing, shielding, and ziplining. The end goal is to reach the final stage by destroying enemies, collecting collectibles, avoiding projectiles, spikes, and avoid falling.",
        
        "titleSlashPCVR": "Slashing Motion",
        "titleVRPovPCVR": "VR Point of View",
        "titleZiplinePCVR": "Zipline Movement",
        "title2DPCVR": "2D Perspective",
        "descSlashPCVR": "PC player can move, jump, and dash which allows the VR player to be in contact with obstacles which the VR player can then destroy if presented with a sword and doing a slash motion in real life, there is also a shield that allows protection from enemy projectiles which prevent the death of both the PC and VR players.",
        "descVRPovPCVR": "The VR Player has full control of hands which it can grab a laser gun like in real life and shoot it with the VR controller called the XR. The enemies can shoot back with projectiles which can hit the players, but the enemies can also be killed if a laser projectile come into contact with the enemy.",
        "descZiplinePCVR": "Since the VR has full control of hands it can attach itself to ziplines that allow a different kind of movement that the PC player cannot do. The PC and VR can then proceed to the next platform, stage, or area. There is also climbing movement that allows the VR player to help the PC player get into different heights.",
        "desc2DPCVR": "When reaching a certain area, the area begins to turn into 2 dimensional which the perspective of the PC player turns into 2D while the VR player remains unchanged. By cooperating together, the area can then be beaten to reach the final area.",
        
        "resume": "Resume",
        "email": "Email"


    },

    "es": {
        "spanish": "Español",
        "english": "Inglés",
        "japanese": "Japonés",


        "aboutHeader": "Sobre mí -Patch",


        "titleBGM": "BGM-App (Aplicación de Música)",
        "detailsHeader": "???",
        "detailsBGM": "???",



        "resume": "Resume",
        "email": "Correo Electrónico"
    },

    "ja": {
        "spanish": "スペイン語",
        "english": "英語",
        "japanese": "日本語",

        "aboutHeader": "僕のこと -パッチ",
        "aboutIntro1": "ヾ(≧∇≦*)ゝ　ハローアンドようこそいらっしゃいました僕のポートフォリオへ。僕のフルネームはSebastian(セバスチャン) Rodriguez(ロドリゲス) Medina(メディナ)ですが、Patch(パッチ)と呼んでいただいてもいいです。現在、僕は母校であるプエルトリコ・バヤモン大学の4年生で、コンピュータサイエンスの経験を積んでいます。また、高校生時代にも勉強をしており、合わせて約",
        "aboutIntro2": "年ほどの経験があります。<(￣︶￣)>",
        "aboutCenter": "",
        "aboutEnd": "自由にプロジェクトをご確認いただければ、そのプロジェクトのアイデアが見えてきたり、プロジェクトの出来るごともわかるかもしれません。もしコンタクトをご希望でしたら、",
        "aboutHyperlink": "ここ",
        "aboutPoint": "に出来ます。お読みいただき、ありがとうございました！＼（＾∀＾）メ（＾∀＾）ノ",

        "demo": "デモを試す",
        "video": "プレビューを見る",

        "tutorial": "画像をクリックすると、プロジェクトを閲覧することができます。",

        "detailsHeader": "プロジェクトの説明",

        "titleBGM": "BGM-APP (ビージーエム・アプリ)",
        "detailsBGM": "???",

        "resume": "履歴書",
        "email": "メール"
    }
}